{
    "Apply Eye Makeup": [
        "Use of brushes or applicators to apply product around the eyes.",
        "Vivid color palettes often including shades of eyeshadow, eyeliner, and mascara.",
        "Focus on the eye area, with attention on lashes and eyelids.",
        "Potential for blending techniques visible on the eyelids.",
        "Finished look often includes defined shapes or lines around the eyes.",
        "Focus on the eyes with products like shadow, eyeliner, and mascara.",
        "Various applicators such as brushes, sponges, or wands specifically for eye products.",
        "Bright and contrasting colors often used, enhancing the eyelid area.",
        "Application involves intricate techniques like blending and layering.",
        "May include false lashes or eyelash curlers prominently displayed.",
        "Use of brushes or applicators for precision.",
        "Various colors and textures (matte, shimmer) on eyelids.",
        "Focus on the eye area, highlighting eyelashes and eyebrows.",
        "Often involves a mirror for detailed application.",
        "May include additional tools like eyelash curlers.",
        "Use of a variety of brushes and applicators specific to eye makeup.",
        "Diverse range of colors and textures, including eyeshadows, eyeliners, and mascaras.",
        "Focus on the eye area, with products often applied on eyelids, along the lash line, and on eyelashes.",
        "Precise application techniques involving layering and blending.",
        "Potentially visible face makeup (foundation, concealer) but mainly emphasizes the eyes.",
        "Close-up visuals of the eyes, showcasing lashes and lids.",
        "Variety of colors and textures of eyeshadows applied across the eyelid.",
        "Use of brushes and applicators specifically designed for the eye area.",
        "Potentially visible eye tools like tweezers for eyebrow shaping.",
        "Application process may involve layering products for depth."
    ],
    "Apply Lipstick": [
        "Application of product directly onto the lips, often with a separate applicator or brush.",
        "Variety of colors, including bold and matte finishes distinctively on the lips.",
        "Focus on the mouth area, showcasing lip shape and fullness.",
        "Can include outlining or defining the lips with lipliner prior to application.",
        "Glossy or matte textures are clearly visible on the surface of the lips.",
        "Application primarily centered on the lips, using a bullet, liquid, or gloss.",
        "Product often has a wide variety of colors and finishes, such as matte or glossy.",
        "Tools may include lip brushes or applicators for precision.",
        "Techniques typically involve filling in the entire lip area.",
        "Color may contrast strongly with the eye makeup for a balanced look.",
        "Application directly on lips with a bullet or applicator.",
        "Bright and bold colors, often glossy or matte finish.",
        "Focus on the lip area, with emphasis on shaping.",
        "Can involve lip liners for contouring and definition.",
        "Frequently includes hand movement close to the face.",
        "Application involves direct contact with the lips and can include various tools like brushes or tubes.",
        "Lip colors can vary widely, from bold hues to nude shades, with matte or glossy finishes.",
        "Close-up focus on the lips, including shape and texture.",
        "May include lip liner for definition, often visible around the lip edges.",
        "Artistry can involve gradients or ombre effects for a layered look.",
        "Focus on the lips, often seen in a bright or bold color.",
        "Vivid contrast between the skin tone and the lipstick shade.",
        "Typically involves a lip brush or lipstick tube in close proximity.",
        "Possible presence of lip liner being used for definition.",
        "Can include glossy or matte finishes visible on the lips."
    ],
    "Archery": [
        "Use of a bow and arrow, with the archer aiming towards a target.",
        "Distinctive posture, with one arm extended holding the bow and the other drawing the arrow back.",
        "Quiver attached to the archer, holding multiple arrows.",
        "Focus on the target area, often marked with concentric circles.",
        "Archery gear, such as arm guards and finger tabs, may be prominently visible.",
        "Use of a bow, with distinctive shape and grip visible.",
        "Presence of arrows, usually fletched, with distinct tips and vanes.",
        "Archer's stance and posture are critical, often showcasing balance and focus.",
        "Target board with concentric circles or points, indicating distance and aim.",
        "Equipment may include protective gear such as arm guards or finger tabs.",
        "Presence of a bow and arrow, with the archer aiming.",
        "Archer's stance is defined, often with a focused expression.",
        "Target visible in the distance, often circular with marked scoring zones.",
        "String of the bow is taut, indicating tension and preparation to shoot.",
        "Quiver for holding arrows may be present on the archer.",
        "Archer's stance with feet positioned for stability, often slightly apart.",
        "Presence of a bow and arrow, with the bowstring visibly pulled back.",
        "Focus on the archer's face, showing concentration, possibly with an open mouth or narrowed eyes.",
        "Target in the background, often circular or square, indicating distance.",
        "Typically outdoors, with clear sight lines and background scenery.",
        "Bow and arrow prominently displayed, with the archer in stance.",
        "Target board located at a distance behind the archer.",
        "Arm movements can show tension in posture and focus.",
        "Quiver with arrows visible on the side, usually strapped to the body.",
        "Use of protective gear like finger tabs or arm guards."
    ],
    "Baby Crawling": [
        "A baby on hands and knees moving forward.",
        "Usually depicted with a close-up on the baby’s face, showcasing expressions of focus or determination.",
        "Background may be soft, emphasizing the baby’s movement.",
        "Clothes may be colorful and childlike, often with patterns.",
        "Hands and knees visibly in contact with the floor, often showcasing playfulness.",
        "Infant positioned on hands and knees, often with a playful expression.",
        "Close-up view showing tiny hands and knees against a surface.",
        "The background may include toys or soft mats for safety.",
        "Movement captured in motion, with a focus on body coordination.",
        "Clothing often includes bright colors or playful patterns.",
        "Baby positioned on hands and knees or tummy, moving forward.",
        "Often surrounded by colorful toys or a play mat.",
        "Facial expressions may show concentration or joy.",
        "Limbs are smaller and proportioned differently compared to adults.",
        "Movement depicts a crawling action, often using age-appropriate clothing (e.g., onesies).",
        "Baby on hands and knees, showcasing different stages of crawling.",
        "Typically seen on a soft surface, like a carpet or blanket.",
        "Child-friendly environment decorated with toys, bright colors, and playful elements.",
        "Focus on the baby’s expressions, highlighting curiosity or determination.",
        "Commonly involves a wobbly stance, with arms and legs often moving in tandem.",
        "Focus on the baby in a crawling position, often on hands and knees.",
        "Soft, rounded features of the baby, emphasizing innocence.",
        "Possible presence of toys or colorful mats around for stimulation.",
        "Expressions of concentration or joy on the baby's face.",
        "Varied clothing styles for the baby, often bright and textured."
    ],
    "Balance Beam": [
        "A gymnast performing on a narrow beam elevated off the ground.",
        "Focus on the gymnast's pose, often in mid-air or balancing precariously.",
        "The beam is a solid, horizontal bar, emphasizing the difficulty of the task.",
        "Gymnastics attire, typically tight-fitting and possibly adorned with sparkles, may contrast with the neutral-color beam.",
        "Surrounding area may show judges or audience members watching attentively.",
        "Narrow beam elevated above the ground, showcasing its length and width.",
        "Gymnast appearing on the beam, displaying balance and poise.",
        "Often dressed in form-fitting leotards, emphasizing body alignment.",
        "Acrobatics or poses with limbs extended or bent, demonstrating skill.",
        "Focus on both the gymnast's concentration and the height of the beam.",
        "A narrow, elevated wood or synthetic beam.",
        "Performer in a gymnastic pose, displaying balance and poise.",
        "Visual emphasis on foot placement and body alignment.",
        "Often set in a gymnasium environment with mats and spectators.",
        "Attire consists of leotards or athletic wear appropriate for gymnastics.",
        "Narrow beam, typically made of wood or synthetic materials, raised above the ground.",
        "Gymnast's pose often includes one foot on the beam while arms are extended for balance.",
        "High concentration on the athlete's face, often showing determination or focus.",
        "Presence of a gymnasium environment with mats or safety equipment nearby.",
        "Movements may include jumps, turns, or poses that highlight skill and artistry.",
        "Narrow beam that is raised above the ground, usually in gym settings.",
        "Gymnasts performing various stunts or poses upon the beam.",
        "Use of chalk visible on hands and the beam's surface.",
        "Judges or spectators in the background, attentively watching.",
        "Emphasis on balancing techniques, with certain body movements."
    ],
    "Band Marching": [
        "Group of musicians in uniform, carrying instruments while marching.",
        "Organization in formation, showcasing symmetry and discipline.",
        "Visibility of various instruments like trumpets, drums, and tubas.",
        "Colorful uniforms often featuring unique designs and accessories.",
        "Movement captured in a synchronized manner, suggesting rhythm and precision.",
        "Musicians in uniform, often marching in a formation.",
        "Instruments visible, such as brass, woodwinds, or percussion.",
        "Colorful flags or banners may accompany the music performance.",
        "Dynamic movements captured as members move in synchrony.",
        "Outdoor setting with potential audience in the background.",
        "Musicians in uniforms, often with distinct colors and patterns.",
        "Instruments visible (e.g., trumpets, drums) being played while marching.",
        "Formation shapes on the field, showing coordinated movement.",
        "Occasional flags or banners, adding visual diversity.",
        "Movement involves synchronized steps with a marching cadence.",
        "Uniformed individuals moving in synchronized formations.",
        "Presence of instruments, such as trumpets, drums, or woodwinds, often held in playing position.",
        "Colorful uniforms that may include hats, sashes, and dramatic patterns.",
        "Visible choreography, with marching steps and arm movements coordinated as a group.",
        "Background scenes at a parade or competition, with spectators watching.",
        "Musicians in uniform, synchronized movement across a field or parade route.",
        "Various instruments held, such as brass, woodwinds, and percussion.",
        "Colorful flags or banners often added to the visual spectacle.",
        "Formation patterns visible on the ground, showcasing coordination.",
        "Diverse expressions of focus and determination among performers."
    ],
    "Baseball Pitch": [
        "A pitcher winding up to throw a baseball, showcasing dynamic body movement.",
        "Focus on the arm position, often with a distinct grip on the ball.",
        "The baseball field in the background, highlighting the pitcher’s location.",
        "Uniform details, including team colors and logos, may be prominent.",
        "Other players on the field can be seen readying for the play, illustrating action.",
        "Pitcher in a windup position, with a baseball prominently held.",
        "Distinctive baseball uniform, including cap and cleats.",
        "Motion freeze-frame showing kinetic energy buildup.",
        "Baseball diamond layout in the background, including bases.",
        "Opposing batter positioned in the foreground, ready to react.",
        "Pitcher on a mound, winds up with a focused expression.",
        "Baseball in hand, often highlighted against a blurred background.",
        "Pitching stance with body coiling, preparing for release.",
        "Catcher positioned behind home plate, often in protective gear.",
        "Infield or outfield players in readiness stance, observing the pitch.",
        "Pitcher on a mound in a dynamic throwing position, emphasizing body posture and arm movement.",
        "Catcher crouched behind home plate, ready to receive the pitch.",
        "Baseball’s distinctive white ball, often shown mid-flight or just before release.",
        "Distinct field markings, such as pitcher’s mound and home plate.",
        "Players in baseball uniforms, typically including caps and jerseys.",
        "Pitcher in a wind-up position, focusing on the baseball.",
        "Visible baseball glove on one hand, ready to receive the ball.",
        "Catcher positioned behind home plate in protective gear.",
        "Infielders and outfielders in predetermined positions around the diamond.",
        "Dynamic body posture indicating motion and intensity of the pitch."
    ],
    "Basketball": [
        "A player dribbling a basketball, often in action with a dynamic posture.",
        "The basketball clearly visible, showcasing its iconic orange color and texture.",
        "Court markings (three-point line, free-throw line) in the background.",
        "Players typically wearing jerseys, with team logos and numbers visible.",
        "Hoop and net structure in the background, highlighting the goal of the game.",
        "Player holding or dribbling a basketball, showcasing texture and grip.",
        "Action setting in a gym or outdoor court with markings.",
        "Colorful team jerseys with logos and numbers visible.",
        "The hoop and net prominent in the background or part of the shot.",
        "Movement indicating speed and agility, often in a jump or run.",
        "Player dribbling or shooting a basketball, with dynamic movement.",
        "Hoop and backboard prominently visible in the background.",
        "Players may wear jerseys with distinctive team colors.",
        "Court lines and markings defining boundaries are visible.",
        "Action poses conveying motion, like jumping or sprinting.",
        "Presence of a basketball and hoop, showing the court lines and three-point arcs.",
        "Players in motion, often dribbling or preparing to shoot with defined body positions.",
        "Uniforms featuring team colors and numbers, usually loose-fitting for movement.",
        "Spectators or coaches visible in the background, highlighting a game situation.",
        "Basketball shoes that show high tops or performance design elements.",
        "Basketball court marked with clear lines, including three-point arc.",
        "Basketball prominently displayed, often in a player's hand.",
        "Players in motion, running or dribbling the ball against defenders.",
        "Hoop and net area visible, with potential for scoring action.",
        "Varied team jerseys creating a colorful visual contrast."
    ],
    "Basketball Dunk": [
        "A player leaping into the air with the basketball above the rim.",
        "Focus on the player’s athleticism, captured mid-flight.",
        "The basketball hoop is prominently featured, emphasizing the action.",
        "Motion blur or action lines may depict the speed and force of the dunk.",
        "Audience or teammates may be shown reacting to the play in the background.",
        "Player elevated in mid-air, with basketball above head.",
        "Dynamic pose showcasing athleticism and extension.",
        "Hoop and net visibly impacted or in motion from the dunk.",
        "Colorful athletic gear, possibly with sweat or intensity captured.",
        "Gym environment, often with spectators in the background.",
        "Player in mid-air, reaching towards the hoop with the ball.",
        "Dramatic upward motion, showcasing athleticism and height.",
        "Rim and net visible, possibly swaying from the impact.",
        "Other players likely positioned watching below or attempting to block.",
        "High-energy atmosphere captured, often with audience in action.",
        "Player airborne in a dramatic pose with one or both hands reaching for the basketball hoop.",
        "The basketball hoop, often with a net visibly moving from the dunk.",
        "Opponents or teammates in varied poses, showcasing reactions to the dunk.",
        "Intense facial expression from the player executing the dunk, emphasizing effort.",
        "Dynamic motion blur around the player to emphasize speed and power.",
        "Player mid-air, showcasing athleticism and height during the dunk.",
        "Strong visual focus on the basketball going into the hoop.",
        "Expression of effort and excitement on the player's face.",
        "Crowd reaction often visible in the background, showing enthusiasm.",
        "Players involved in defense or celebration to either side."
    ],
    "Bench Press": [
        "A person lying on a bench lifting a barbell over their chest.",
        "Focus on the barbell, often loaded with weights on either side.",
        "Strained expressions indicating effort, with muscles visibly tensed.",
        "Gym setting with other equipment in the background may be present.",
        "Spotters often visible, ensuring safety while lifting.",
        "Barbell positioned over a lifter on a weight bench.",
        "Individual’s body posture showcasing muscle engagement.",
        "Weights on either side of the barbell clearly visible.",
        "Spotlight or gym lighting emphasizing the atmosphere.",
        "Supportive equipment or gym surroundings depicted prominently.",
        "Individual lying on a bench, pushing a barbell upward.",
        "Weight plates clearly visible on either side of the barbell.",
        "Focused expression indicating exertion and muscular effort.",
        "Spotter may be present, assisting from above for safety.",
        "Gym setting shown, with equipment and weights around.",
        "Barbell held above a bench, emphasizing the weight being lifted.",
        "Lifter in a supine position with arms raised, usually wearing athletic clothing.",
        "Gym setting with weights and equipment in the background.",
        "Focus on the lifter’s face, illustrating concentration and exertion.",
        "Spotters or assistants nearby for safety support, showing the collaborative aspect.",
        "Weight bar resting across the chest of the individual.",
        "Presence of weights on either side of the bar, indicating load.",
        "Focused facial expression showing effort during the lift.",
        "Spotter visible behind, ready to assist if necessary.",
        "Gym setting with benches and equipment surrounding the lifter."
    ],
    "Biking": [
        "A cyclist on a bicycle, often depicted in a dynamic pedaling position.",
        "Focus on the bicycle's wheel movement, showcasing speed.",
        "Headgear (helmet) and specialized cycling attire may be prominently featured.",
        "Surroundings like roads, trails, or nature to illustrate the biking environment.",
        "Handlebar grips, bike frame shapes, and gears visible, highlighting the sport's gear.",
        "Cyclist on a bicycle, with a focus on the bike frame and wheels.",
        "Movement captured with a wind-blown effect on clothing and hair.",
        "Road or trail visible in the background indicating speed or distance.",
        "Protective gear like helmets and padded shorts prominently displayed.",
        "Environment may include nature or urban settings enhancing context.",
        "Cyclist in athletic gear, mounted on a bicycle.",
        "Motion blur may indicate speed, with wheels spinning.",
        "Outdoor landscape or roadways providing context, like trees or buildings.",
        "Focus on the cyclist's posture, hands on handlebars, and foot positions.",
        "Helmets and protective gear are typically visible for safety.",
        "Cyclist on a bicycle, typically in a forward-leaning position for speed.",
        "Road or trail visible beneath the wheels, indicating movement.",
        "Cycling gear, including helmet, padded shorts, and jerseys with bright colors.",
        "Hand placement on the handlebars with an aerodynamic posture.",
        "Possible presence of other cyclists or scenery showcasing nature or a race environment.",
        "Cyclist in motion, typically on a road or path.",
        "Bicycle features such as handlebar, wheels, and frame clearly visible.",
        "Cyclist wearing helmets and attire designed for aerodynamics.",
        "Surrounding environment may include trees, roads, or urban settings.",
        "Dynamic posture showing leaning into turns or pedaling effort."
    ],
    "Billiards": [
        "A player poised to strike a billiard ball with a cue stick.",
        "Close-up on the felt surface of the billiard table, highlighting the balls’ arrangement.",
        "Player's stance and focus on the shot emphasized.",
        "Unique billiard balls (striped/solid) and numbers clearly visible on the table.",
        "Lighting often focused on the table area, creating a dramatic effect.",
        "Pool table with colorful balls in a specific arrangement.",
        "Cue stick in position of hitting a ball, showing action.",
        "Close view of balls' colors and shine against the felt.",
        "Surroundings may include bar or game room decor.",
        "Players' expressions or stances focused on strategy and technique.",
        "Table with green felt, visible balls in a triangular rack.",
        "Cue stick in use, with player lining up a shot.",
        "Concentrated facial expressions, indicating focus on the game.",
        "Surrounding area may include other players or spectators.",
        "Lighting focused on the table surface, enhancing visibility.",
        "Table with green felt surface, featuring billiard balls in triangular formation.",
        "Cue stick in player’s hands, poised for striking the cue ball.",
        "Close-up focus on the billiard balls, highlighting colors and numbers.",
        "Chalk applied to the cue tip visible in the foreground.",
        "Background players or observers in a recreational room or pool hall.",
        "Close-up focus on a billiards table with colored balls arranged neatly.",
        "Cue stick positioned above a ball, showcasing a shooting angle.",
        "Possible chalk residue on the cue stick indicating preparation.",
        "Players’ expressive body posture as they take shots.",
        "Pool table dimensions with pockets and felt clearly delineated."
    ],
    "Blow Dry Hair": [
        "A person with damp hair being styled with a blow dryer.",
        "Focus on the hair’s texture, showcasing volume and flow.",
        "Use of various styling brushes or tools in the process.",
        "Hairdryer's airflow and sound can be visually indicated with movement effect.",
        "Background may include hair products or a salon setting for context.",
        "Hairstylist using a blow dryer, emphasizing airflow and movement.",
        "Hair strands visibly blowing and curling under heat.",
        "Products like brushes or heat protectants prominently displayed.",
        "Variations in hair texture and length highlighted in the process.",
        "Salon environment with mirrors and lighting enhancing the scene.",
        "Hair being styled with a blow dryer, often held close to the head.",
        "Visual focus on hair's movement and volume due to airflow.",
        "Mirror reflection showing stylist or the person getting styled.",
        "Products like brushes or styling sprays may be present.",
        "Light contrasts may highlight the shine and texture of the hair.",
        "Hairdryer held near the subject’s head, with warm air visibly blowing.",
        "Hair often styled or voluminous due to the drying process, showing texture.",
        "Face reflecting concentration, with possible product use visible.",
        "Surrounding styling tools (brushes, clips) on a counter or nearby.",
        "Hair being directed with a brush, emphasizing control and technique.",
        "Hairdryer held close to the hair, dispersing air visibly.",
        "Flowing hair with potential movement from the airflow.",
        "Styling tools, such as brushes or combs, evident in the process.",
        "Managed sectioning of hair for even drying.",
        "Possible presence of mirrors reflecting styling efforts."
    ],
    "Blowing Candles": [
        "A person leaning towards a cake with lit candles ready to blow.",
        "Focus on the flame and the force of breath towards it.",
        "The cake is often colorful and decorated, emphasizing a festive atmosphere.",
        "Joyful expressions on the person’s face, capturing a celebratory moment.",
        "Surroundings may include other party decorations or guests watching.",
        "Birthday cake with lit candles prominently displayed.",
        "Blow of air visibly flickering candle flames.",
        "Expressions of joy or anticipation captured on faces.",
        "Surrounding decorations like balloons or party items.",
        "Close-up focus on lips pursed to blow, enhancing action.",
        "Person blowing towards the candles, with puffs of breath visible.",
        "Facial expressions showing excitement or joy.",
        "Decorations around the cake may include colors and themes.",
        "Hands positioned close to the cake, often reaching out.",
        "Birthday cake with lit candles, showcasing brightness against the cake.",
        "Child or adult leaning forward, mouth open in the act of blowing.",
        "Possible frosting decorations on the cake, indicating a festive occasion.",
        "Family or friends in the background, showing expressions of excitement.",
        "Smoke trails rising from extinguished candles, capturing the moment.",
        "Birthday cake with candles prominently featured.",
        "Physical action of a person blowing air towards candles.",
        "Expressions of joy or anticipation on the person's face.",
        "Flames flickering from candles, some possibly extinguishing.",
        "Decorative cake elements around candles providing a festive background.",
        "Individual leaning towards a cake or dessert with candles."
    ],
    "Body Weight Squats": [
        "A person in a squatting position, often depicted with knees bent.",
        "Focus on the leg muscles engaged during the movement.",
        "Hands may be positioned for balance, either forward or behind.",
        "An environment like a gym or outdoor space providing context.",
        "Inspirational workout attire, often in bright colors or gym-specific gear.",
        "Individual in a squatting position, showcasing leg muscles.",
        "Background may include a gym or outdoor space.",
        "Focus on form and alignment, highlighting posture.",
        "Potential use of a mat or flooring depicted.",
        "Other individuals may be present, indicating group exercise.",
        "Individual in a squatting position, legs bent at the knees.",
        "Feet flat on the ground, with weight leaning back.",
        "Clear focus on lower body strength and posture.",
        "Gym setting or outdoor environment often in view.",
        "Facial expression showing effort or exertion.",
        "Individual in a squat position, thighs parallel to the ground or lower.",
        "Emphasis on proper form with knees aligned over toes and back straight.",
        "Athletic clothing showcasing movement and flexibility.",
        "Ground surface visible, indicating workout or exercise environment.",
        "Concentrated facial expression, highlighting effort and focus.",
        "Individual squatting with body weight, emphasizing leg movement.",
        "Arms often positioned in front for balance.",
        "Focus on muscle engagement, especially in legs and core.",
        "Gym or outdoor setting highlighting workout environment.",
        "Use of mats or equipment nearby for supportive workout activities."
    ],
    "Bowling": [
        "A bowler in a stance preparing to roll a bowling ball towards pins.",
        "The bowling ball is distinct, often shiny and colorful, contrasting with the lane.",
        "Bowling pins arranged at the end of the lane, suggesting the target.",
        "Motion may show a swinging arm and the approach towards the lane.",
        "The bowling alley’s characteristic design and lighting may frame the scene.",
        "Bowler poised to release the ball, capturing motion.",
        "Bowling ball prominently featured, often shiny and weighted.",
        "Pins visible at the end of the lane, emphasizing focus on target.",
        "Bowler’s attire, often casual, capturing the leisure aspect.",
        "Lane markings and ball return system integrated into scene.",
        "Bowler in motion, releasing a bowling ball toward pins.",
        "Lane with illuminated markers and ten pins at the end.",
        "Sweeping motion captured, often with focus on the ball's trajectory.",
        "Bowler’s stance and foot placement are crucial.",
        "Spectators may be visible in the background, watching intently.",
        "Bowler in a crouched position, preparing to release the ball.",
        "Bowling ball in motion toward pins at the end of the lane.",
        "Bowling shoes worn, often with a distinctive design.",
        "Pins visible in the background, some potentially in motion.",
        "Colorful bowling alley features, including lane markings and signage.",
        "Bowler in motion, releasing the ball down the lane.",
        "Bowling pins neatly arranged at the end of the lane, ready to be struck.",
        "Lane markings and boundaries clear in the view.",
        "Ball's trajectory possibly captured mid-roll.",
        "Reactions from onlookers or teammates visible in the background."
    ],
    "Boxing Punching Bag": [
        "A boxer delivering a punch to a heavy bag, showcasing dynamic movement.",
        "Focus on the punching technique, form, and power in the strike.",
        "The punching bag is often suspended, indicating its weight and structure.",
        "Boxing gloves visible, often brightly colored or branded.",
        "Gym environment with other equipment, like gloves or mats, visible in the background.",
        "Heavy bag hung from the ceiling, showing wear and texture.",
        "Boxer striking the bag, emphasizing focus and movement.",
        "Equipment like gloves or wraps visually important.",
        "Surrounding gym environment may include mats or training tools.",
        "Expressions of intensity or determination captured on the boxer's face.",
        "Boxer throwing punches at a hanging punching bag.",
        "Dynamic motion of arms depicted, showing strength and technique.",
        "Boxing gloves are typically bright compared to the bag itself.",
        "Gym interior with mirrors or training equipment in the background.",
        "Focused facial expressions indicate concentration during training.",
        "Heavy bag suspended from the ceiling or wall, ready for impact.",
        "Gloves on the boxer’s hands, poised to deliver power.",
        "Focus on muscle definition and effort during the punch.",
        "Boxing gym environment with equipment (gloves, wraps) visible.",
        "Sweat or intensity on the boxer's face, illustrating physical exertion.",
        "Heavy bag hanging, with focus on contact during punches.",
        "Boxer in an athletic stance, gloves raised for striking.",
        "Sweat and determined expressions indicating physical effort.",
        "Potential gym equipment visible in the background.",
        "Impact marks or movement of the bag upon contact clearly observable."
    ],
    "Boxing Speed Bag": [
        "A boxer striking a small, air-filled bag mounted on a platform.",
        "Rapid movement and rhythm emphasized by consistent hits.",
        "The speed bag is small and typically cylindrical, highlighted by its bounce.",
        "Boxer's gloves often show impact and technique during the motion.",
        "Background may include gym features like mirrors or training partners.",
        "Small, fast-moving bag suspended for rapid punching.",
        "Boxer’s hands and gloves prominently featured in action.",
        "Rhythmic motion indicating timing and accuracy.",
        "Equipment setup may include wall mounts and lighting.",
        "Boxer’s focus and form emphasized, showing skill practice.",
        "Boxer striking a small, fast-moving speed bag.",
        "Motion blur showing rapid hand movements.",
        "Boxers’ focus concentrates on rhythm and timing.",
        "Speed bag usually located at a height for proper striking.",
        "Gym environment surrounding, often with noise and action.",
        "Small bag mounted on a platform, typically bouncing rhythmically.",
        "Boxer’s hands quickly striking the bag in a coordinated rhythm.",
        "Boxing gloves highlighting impact with the bag.",
        "Emphasis on footwork with the boxer often in a dynamic position.",
        "Gym equipment visible in the background, like ropes or mats.",
        "Small, fast-moving speed bag visibly bouncing against punches.",
        "Boxer training rhythmically, focused on hand-eye coordination.",
        "Boxing gloves clearly distinguished as part of the training gear.",
        "Training environment possibly showing mirrors or equipment stations.",
        "Quick movements conveying speed and precision during practice."
    ],
    "Breast Stroke": [
        "A swimmer performing the breaststroke, characterized by specific arm and leg movements.",
        "Focus on the swimmer's body position in the water, arms moving simultaneously.",
        "The swimmer's face may be visible above water, showcasing breathing.",
        "Swimming pool's distinctive lines and markings emphasized in the background.",
        "Swimming attire, usually a swimsuit, often highlights colors and designs.",
        "Swimmer positioned in water, demonstrated distinctive arm movement.",
        "Body shown in a horizontal position, with head above water.",
        "Swimming cap and goggles may be visible.",
        "Water splashing around, emphasizing movement and energy.",
        "Lane markings or poolside environment enhancing context.",
        "Swimmer in water performing the breaststroke technique.",
        "Arms moving simultaneously in a circular, sweeping motion.",
        "Legs performing a frog kick, emphasized by water splashes.",
        "Swim cap and goggles often visible, indicating competitive swimming attire.",
        "Lanes or markers in the pool may define swim area.",
        "Swimmer in a horizontal position, with arms synchronized in a sweeping motion.",
        "Head above water, focused expression illustrating effort and technique.",
        "Specific hand movements with palms facing outward and feet kicking.",
        "Ripple effect on the water's surface created by swimmer’s movement.",
        "Swim cap or goggles visible, characteristic of competitive swimming attire.",
        "Swimmers in water displaying the characteristic arm and leg movements.",
        "Bubbles and water splashes visible as a result of strokes.",
        "Swimmers often have their heads turned to one side for breathing.",
        "Swim caps and goggles visible, designed for the activity.",
        "Pool lane markers clearly visible in the swimming environment."
    ],
    "Brushing Teeth": [
        "A person standing in front of a mirror with a toothbrush in hand.",
        "Visible toothpaste on the brush, often in a foamy state.",
        "Close-up of the person’s mouth, highlighting the brushing action.",
        "Bathroom setting with reflections and toiletries visible in the background.",
        "Focus on cleanliness and dental care items, like floss or mouthwash.",
        "Toothbrush with visible bristles in a hand.",
        "Close-up of mouth showing engaging action of brushing.",
        "Toothpaste tube and foam on the brush visible.",
        "Bathroom mirror reflected in background.",
        "Concentrated facial expression indicating personal care.",
        "Toothbrush held close to the mouth, with toothpaste visible.",
        "Focus on brushing motion, often with foam or paste.",
        "Mirror reflection showing facial expression of concentration.",
        "Bathroom environment with sink and hygiene products around.",
        "Bright lighting enhances the clarity of tools used.",
        "Individual holding a toothbrush with toothpaste visibly applied.",
        "Close-up focus on mouth area, often with foam or paste visible.",
        "Bathroom setting, including mirror reflection and other dental products.",
        "Clear facial expressions, showcasing concentration or routine.",
        "Water basin or sink as part of the environment, indicating hygiene practice.",
        "Close-up of a toothbrush with toothpaste applied.",
        "Focus on a person in the act of brushing, often in front of a mirror.",
        "Foamy texture of toothpaste visible around the brush.",
        "Various dental products like mouthwash or floss might be in view.",
        "Vibrant colors of toothbrush and bathroom decor enhancing the visual."
    ],
    "Clean And Jerk": [
        "An athlete lifting a barbell from the ground to shoulder height, then overhead.",
        "Focus on dynamic body positioning and strength in the movement.",
        "Weights on the barbell are noticeable, emphasizing the challenge.",
        "Gym setting with proper flooring and equipment visible in context.",
        "Strained expressions showing effort, with muscles engaged prominently.",
        "Lifter in distinct stance preparing to lift a barbell.",
        "Barbell with weights prominently displayed.",
        "Body posture and core engagement highlighted.",
        "Gym atmosphere with mats and lifting platforms surrounding.",
        "Coach or spectators possibly nearby, enhancing focus on the lift.",
        "Athlete lifting a barbell from floor to shoulders, then overhead.",
        "Powerful stance showing accumulation of strength and technique.",
        "Focus on the barbell, often with weight plates attached.",
        "Spectators or judges may be visible in the background.",
        "Weightlifting attire or belts indicating heavy lifting environment.",
        "Athlete in a lifting stance, barbell held at shoulder level.",
        "Powerful leg and core engagement visible, indicating effort.",
        "Focused facial expression showcasing determination during the lift.",
        "Weight plates on either end of the bar, emphasizing load.",
        "Gym environment with spectators or coaches in the background.",
        "Athlete gripping a barbell, showcasing strength and technique.",
        "Clear division of the clean phase and the jerk phase visually depicted.",
        "Focus on body posture demonstrating balance and control.",
        "Weight plates visible on each side of the barbell.",
        "Potentially visible coaching staff observing the lift."
    ],
    "Cliff Diving": [
        "A diver poised on the edge of a cliff preparing to jump into water below.",
        "The high drop creates a sense of action and thrill in the image.",
        "Surrounding scenery often includes rocky cliffs and crystal-clear water.",
        "Diver's form may be showcased in a unique pose before entering the water.",
        "Background may capture splashes from previous dives or spectators.",
        "Diver in mid-air, body positioned for entry into water.",
        "Cliff silhouette and water below depicted dramatically.",
        "Splash or ripple effects captured near the water surface.",
        "Swimmers or spectators in the background for scale.",
        "Bright sunlight or blue skies above enhancing visual clarity.",
        "Diver poised at the edge of a high cliff.",
        "Water below with splashes indicating previous entries.",
        "Diver captured in mid-air, showcasing posture and form.",
        "Scenic background of cliffs, ocean, or lakes contributing to the shot.",
        "Swimmers or spectators might be present near the water's edge.",
        "Diver in mid-air, showcasing a free-fall position above water.",
        "Rock cliff and water body visible in the background.",
        "Potential for dramatic body angles, including twists or flips.",
        "Expression of excitement or concentration on the diver’s face.",
        "Spectators at the edge, indicating a competitive or recreational event.",
        "Diver mid-air, emphasizing height and acrobatic position.",
        "Water surface below, showcasing incoming splash potential.",
        "Natural surroundings like cliffs and water bodies forming the backdrop.",
        "Expressions of thrill or concentration on the diver's face.",
        "Possible audience positioned along the cliff or shore."
    ],
    "Cricket Bowling": [
        "A bowler running up to deliver a ball with a distinct bowling action.",
        "Focus on the ball's release point and the bowler's stance.",
        "Cricket field markings such as the pitch and wicket are highlighted.",
        "Protective gear such as pads or helmets may be visible on players.",
        "Audience or team members can be seen in the background engaging in the game.",
        "Bowler’s arm in a delivery position, with focus on the ball.",
        "Cricket pitch and stumps clearly visible in the scene.",
        "Bowler’s stance emphasizes aggression and technique.",
        "Fielders positioned in the background, ready for action.",
        "Cricket uniform showing team colors and helmets may be shown.",
        "Bowler in a running stance, preparing to deliver the ball.",
        "Cricket ball clearly visible, positioned in the bowler's hand.",
        "Wicket or stumps in the background, defining the target area.",
        "Fielders positioned strategically, watching the delivery.",
        "Expression of concentration on the bowler's face.",
        "Bowler poised in a delivery stride, with the ball held overhead.",
        "Pitch visible, marked with crease lines and a wicket at the opposite end.",
        "Fielders positioned strategically in the background.",
        "Bowler's intense expression showing focus and determination.",
        "Cricket uniform with colored pads, showing player identity.",
        "Bowler in a dynamic motion, often mid-delivery towards the wicket.",
        "Cricket ball in flight, focused on its trajectory.",
        "Fielders positioned strategically in anticipation of the delivery.",
        "Pitches and creases clearly marked on the cricket field.",
        "Bowler's attire often related to team colors and branding."
    ],
    "Cricket Shot": [
        "A batsman in the middle of striking the ball with a bat.",
        "Focus on the bat’s position and the ball's trajectory toward the field.",
        "The cricket field, with players positioned strategically, is prominently featured.",
        "The batsman’s motion reflecting timing and coordination is crucial.",
        "Protective gear on the batsman stated with vibrant colors and team logos.",
        "Batter in a striking position, focusing on the ball.",
        "Cricket bat displayed prominently, with emphasis on swing.",
        "Stumps and pitch marked clearly behind the action.",
        "Fielders positioned in anticipation of the play.",
        "Uniform colors and striking gear illustrating the sport's context.",
        "Batter in a dynamic stance, preparing to hit the cricket ball.",
        "Bat raised, ready to make contact, showcasing strength.",
        "Fielders in motion, reacting to the shot being played.",
        "Pitch and ground markings visible, defining the playing area.",
        "Colorful cricket uniforms represented, including helmets and pads.",
        "Batter in a dynamic pose with bat raised, preparing to strike the ball.",
        "Cricket ball in the air, illustrating mid-action shot.",
        "Wicket and fielders positioned, highlighting team dynamics.",
        "Batter’s focused expression, indicating anticipation and strategy.",
        "Grass field visible, along with boundary markings.",
        "Batsman poised ready to strike against the incoming delivery.",
        "Cricket bat visibly impacting the ball, showcasing force.",
        "Fielders reacting with specific body language to the strike.",
        "Field layout visible to indicate positions of other players.",
        "Potential impact on the pitch showing signs of wear."
    ],
    "Cutting In Kitchen": [
        "A person chopping ingredients on a cutting board with a knife.",
        "Various fresh ingredients, like vegetables or meats, showcased.",
        "Kitchen utensils and a well-equipped setting clearly visible.",
        "Focus on the action of cutting, highlighting technique and precision.",
        "Colors of the ingredients creating an appetizing visual impact.",
        "Chef or individual with a knife poised above ingredients.",
        "Cutting board displaying various foods like vegetables or meat.",
        "Close view of knife technique, showing skill and precision.",
        "Kitchen tools, pots, and pans surrounding the cutting area.",
        "Bright lighting enhancing the freshness of the ingredients.",
        "Chef or individual with a knife and cutting board in use.",
        "Ingredients like vegetables or fruits present on the board.",
        "Focused facial expression indicating concentration on the task.",
        "Kitchen environment surrounding, with appliances and utensils visible.",
        "Cutting technique showing precision in slices or dicing.",
        "Cutting board with food items, showcasing chopping motion.",
        "Knife held in hand, focused on precision and technique.",
        "Kitchen setting with visible utensils and ingredients.",
        "Possible action or movement in the background with other cooks.",
        "Subject's concentration visible, highlighting culinary skills.",
        "Cutting board prominently displayed with ingredients.",
        "Knife positioned above or in contact with food items.",
        "Colorful assortment of vegetables or fruits evident.",
        "Kitchen settings with utensils and cooking tools visible in the background.",
        "Hands positioned carefully to handle knives or food prep."
    ],
    "Diving": [
        "A diver in an arched position preparing to enter the water.",
        "Clear focus on the diver's form and the height of the dive.",
        "Water surface below creating dynamic movement context.",
        "Pool or ocean backdrop offering visual contrast in colors.",
        "Aquatic gear or swim attire visibly enhancing the scene.",
        "Diver captured in a dynamic pose, either entering or exiting water.",
        "Distinctive swimsuit or diving gear highlighted in contrast with water.",
        "Splash effects and body posture indicating technique and skill.",
        "Diving board visible overhead, enhancing context.",
        "Swimming pool or ocean surface depicted, illustrating depth.",
        "Diver poised at the edge of a diving board, preparing to jump.",
        "Distinct water surface below with ripples or splashes from previous divers.",
        "Athletic swimwear worn, indicating competitive dive.",
        "Mid-air position captured as diver executes form.",
        "Pool environment with lanes or spectators on the edge.",
        "Diver in a mid-air position above the water, possibly performing a twist or flip.",
        "Clear view of the swimming pool or ocean below.",
        "Diver’s body streamlined for entry, arms and legs positioned for optimal form.",
        "Focused facial expression as the diver prepares for the splash.",
        "Splash effect captured as the diver enters the water.",
        "Diver captured mid-air, showcasing form before entering the water.",
        "Splashes of water clearly indicated around the entry point.",
        "Surrounding environment featuring a diving board or platform.",
        "Variety of dive stances or rotations may be visually showcased.",
        "Audience or fellow divers present in the background, observing."
    ],
    "Drumming": [
        "A drummer actively hitting drums with sticks, showcasing rhythm.",
        "Visible drum kit components including snare, toms, and cymbals.",
        "Motion represented by movement blur on sticks or bouncing drumheads.",
        "Engaged expression on the drummer's face, reflecting concentration.",
        "Stage lighting may create a dynamic atmosphere, emphasizing performance.",
        "Drummer seated at a drum set, focus on sticks in action.",
        "Variety of drums and cymbals presented prominently.",
        "Feet on pedals, indicating coordination and rhythm.",
        "Muscular tension or expression of joy while playing.",
        "Stage or band setup in background enhancing musical context.",
        "Drummer seated behind a drum set, actively striking drums.",
        "Sticks in motion, with visible movement captures.",
        "Drums of various sizes clearly defined, often brightly colored.",
        "Focus on the rhythmic motion and energy of the performance.",
        "Band setting or stage lights enhancing the visual dynamics.",
        "Drummer seated behind a drum kit, with visible drums and cymbals.",
        "Drumsticks raised, captured mid-action striking the drums.",
        "Dynamic body movement, showcasing energy and rhythm.",
        "Background usually includes band members or performance setting.",
        "Facial expression reflecting concentration and enjoyment during play.",
        "Drum kit prominently displayed with various drums and cymbals.",
        "Drummer's hands depicted mid-action, striking drum surfaces.",
        "Percussion sticks visibly in motion, enhancing rhythmic focus.",
        "Dynamic facial expressions conveying concentration and energy.",
        "Music sheets or amps possibly visible in the background."
    ],
    "Fencing": [
        "Two fencers in full gear, poised with swords in an attack or defense stance.",
        "Protective masks and suits are clearly defining the sport's safety features.",
        "Visible blade movement indicating speed and precision in action.",
        "Fencing piste marked on the ground, showcasing the competition area.",
        "Dynamic footwork highlighted in the fencers’ stances.",
        "Fencers dressed in protective gear, showcasing masks and outfits.",
        "Distinctive swords (foils, epees, or sabers) prominently displayed.",
        "Action-packed stance illustrating determent and strategy.",
        "Background may show a fencing piste or spectators.",
        "Body movements indicating agility and precision in duel.",
        "Fencers in protective gear, poised in combat stances.",
        "Weapons (epees/sabers) extended, ready for engagement.",
        "Masks covering faces, adding anonymity to the sport.",
        "Strip markings on the floor defining the fencing area.",
        "Dynamic movement as fencers attempt to strike each other.",
        "Fencer in a starting position, with mask and protective gear visible.",
        "Epee or foil in hand, with the blade extended toward the opponent.",
        "Footwork captured in dynamic motion, indicating agility.",
        "Opponent in a parallel stance, indicating competition.",
        "Brightly-lit fencing area or gym backdrop, showcasing the environment.",
        "Fencers in protective gear, showcasing the sport's unique attire.",
        "Swords (foils, epees, or sabres) visibly engaged in a duel.",
        "Footwork patterns and lunging movements highlighted in action.",
        "Scoring lights or referees visible in the surrounding area.",
        "Match boundaries or fencing strips clearly defined."
    ],
    "Field Hockey Penalty": [
        "A player preparing to take a shot on goal with a hockey stick.",
        "Goalkeeper in position, showcasing protective gear and anticipation.",
        "Field hockey ball prominently visible near the stick's blade.",
        "Field markings (like circles and lines) clearly visible in the background.",
        "Players in team uniforms, often vibrant, contributing to the scene's energy.",
        "Player poised in a striking position at the penalty spot.",
        "Field hockey stick prominently shown, angled for a shot.",
        "Goal and goalkeeper contextually presented in background.",
        "Uniform colors and team logos enhancing visual identity.",
        "Intensity and focus in the player’s expression captured.",
        "Player poised with a stick, focused on the ball.",
        "Goal visible in the background, emphasizing target area.",
        "Other players positioned strategically to defend or engage.",
        "Shin guards and protective gear seen on the players.",
        "Outdoor field with turf markings defining game boundaries.",
        "Player with a hockey stick poised to take a shot, body positioned toward goal.",
        "Goal visible in the background, with a goalie ready to defend.",
        "Focused expressions and anticipation on the player's face.",
        "Turf field with field markings, indicating the penalty setup.",
        "Additional players surrounding the area, illustrating team involvement.",
        "Player preparing for a penalty shot on a hockey field.",
        "Field hockey stick prominently displayed, poised for action.",
        "Goalkeeper in position, showcasing readiness for the shot.",
        "Surrounding field elements such as goal posts and turf visible.",
        "Players positioned outside the penalty area, indicating game context."
    ],
    "Floor Gymnastics": [
        "A gymnast performing a routine, often in a pose or leap.",
        "Focus on the mat surface, highlighting the gymnast's movements.",
        "Gymnast's attire, usually in bright colors, accentuating their form.",
        "Judges or audience visible, suggesting competition and evaluation.",
        "Graceful movements captured in action, displaying flexibility and strength.",
        "Gymnast positioned in a flexible pose, showcasing strength.",
        "Brightly colored leotards prominently featured.",
        "Mat surface depicted, indicating performance area.",
        "Movements indicating grace and athleticism captured.",
        "Spectators or judges in the background for event context.",
        "Gymnast performing a routine on a mat or floor.",
        "Dynamic poses capturing strength, flexibility, and elegance.",
        "Bright leotards showcasing colors and team design.",
        "Spectator stands or judges may be seen in the background.",
        "Emphasis on movement and precise landings during routines.",
        "Gymnast in mid-air executing a flip or routine on a mat.",
        "Focused expression indicative of concentration.",
        "Bright leotard or uniform showcasing the athlete's bodylines.",
        "Audience or judges in the background, highlighting performance context.",
        "Mat markings and equipment visible, indicating gymnasium setup.",
        "Gymnast performing a routine on a mat or floor exercise area.",
        "Various body movements captured, showcasing flexibility and strength.",
        "Technical skills such as flips or twists visibly featured.",
        "Judges in the background observing and scoring the performance.",
        "Colorful leotards worn by gymnasts enhancing the visual appeal."
    ],
    "Frisbee Catch": [
        "A person reaching out with arms extended to catch a flying frisbee.",
        "The frisbee is prominently featured in mid-air, showcasing movement.",
        "Outdoor environment, possibly grass or beach, creating a casual setting.",
        "Expression of concentration and excitement on the player’s face.",
        "Other players may be visible in the background, indicating a group activity.",
        "Individual reaching out to catch a brightly-colored frisbee.",
        "Action captured mid-motion, emphasizing excitement.",
        "Environment may consist of grass fields or parks.",
        "Facial expressions showing concentration or joy.",
        "Other players or dogs in the background indicating playfulness.",
        "Player mid-action reaching for a frisbee, body extended.",
        "Frisbee’s circular shape and flight path prominently visible.",
        "Outdoor park or field setting with grass and trees in view.",
        "Expressions show excitement or focus during the catch attempt.",
        "Possible other players in the background, indicating teamwork.",
        "Individual reaching for a flying frisbee, body extended and in motion.",
        "Vibrant colors of the frisbee contrasting with the outdoor environment.",
        "Focus on facial expression, showcasing concentration and anticipation.",
        "Background includes other players or open field, indicating game context.",
        "Possible action blur around hands, emphasizing the speed of the catch.",
        "Individual preparing to catch a flying frisbee in mid-air.",
        "Frisbee in motion, clearly highlighted against the sky.",
        "Surrounding outdoor environment typically featuring grass or trees.",
        "Dynamic body posture indicating movement and reach for the frisbee.",
        "Expressions of joy or excitement on the person's face."
    ],
    "Front Crawl": [
        "A swimmer engaging in the front crawl, characterized by alternating arm strokes.",
        "Focus on the swimmer’s body position in the water, emphasizing streamlined form.",
        "Water splashes clearly visible around the swimmer’s movements.",
        "Swim cap and goggles worn by the swimmer may stand out in colors.",
        "Swimming pool markings in the background aid in visual context.",
        "Swimmer captured in a forward stroke position.",
        "Water splashing around, emphasizing movement and speed.",
        "Swimming cap and goggles clearly visible.",
        "Distinctive arm and leg motions illustrating technique.",
        "Pool lane markings depicted for context.",
        "Swimmer in water using a freestyle stroke technique.",
        "Arms alternating in motion, with splashes evident.",
        "Face positioned in the water or turned sideways for breathing.",
        "Swim cap visible, indicating competitive swimming attire.",
        "Lanes or pool walls providing context for the swimming action.",
        "Swimmer in a horizontal position showing arm strokes forward in water.",
        "Head turned to the side for breathing, showcasing technique.",
        "Water splashes created by hand entry and foot kicks.",
        "Swim cap and goggles visible, indicating competitive swimming.",
        "Pool lane markings or tiles visible in the background.",
        "Swimmer executing a front crawl stroke in a pool.",
        "Splashes of water visible, indicative of powerful arm movements.",
        "Swimmer's head typically positioned in the water.",
        "Swim cap and goggles worn for efficiency, visible in action.",
        "Pool lanes marked, showcasing competitive environment."
    ],
    "Golf Swing": [
        "A golfer mid-swing, with a club raised high, preparing to make contact with the ball.",
        "Focus on the ball at the tee, capturing the essence of the game.",
        "Wide stance and balanced posture illustrating technique and precision.",
        "Golf course details, such as grass and flags, frame the scene.",
        "Golf attire, often consisting of caps and collared shirts, adds to the visuals.",
        "Golfer in a wide stance, club poised in mid-swing.",
        "Golf ball positioned on a tee, with green turf visible.",
        "Dynamic motion illustrating power and focus.",
        "Background may include trees or even a golf course.",
        "Golf attire captured, including cap and shoes.",
        "Golfer in stance preparing to swing a club.",
        "Ball positioned on a tee, surrounded by green turf.",
        "Focus on the golfer's body posture and grip on the club.",
        "Scenic background, including holes or trees, adding context.",
        "Motion captured as the club moves towards the ball.",
        "Golfer in a swing position, with club above shoulder ready for impact.",
        "Focused expression illustrating concentration on the ball.",
        "Golf ball on tee, ready to be struck, usually on a green grass surface.",
        "Golf course background with fairway and greens visible.",
        "Golf attire including cap and polo shirt visible, showcasing the sport style.",
        "Player in a stance, preparing to swing a golf club.",
        "Golf ball positioned on a tee, ready for striking.",
        "Motion lines or blur could depict the swinging action.",
        "Golf course elements like grass, trees, and flags visible.",
        "Player's focused expression indicating concentration during the swing."
    ],
    "Haircut": [
        "A hairstylist cutting or styling hair with scissors or clippers.",
        "Focus on the hair being cut, often showcasing different lengths and styles.",
        "Salon environment with mirrors and salon chairs present.",
        "Client’s expression can reflect satisfaction or anticipation about the style.",
        "Hair clippings often visible on the floor, illustrating the process.",
        "Hairdresser using scissors or clippers, focused on hair.",
        "Chair or station featured prominently in salon.",
        "Hair trimmings visible on the ground or stylist's apron.",
        "Client’s expression showing relaxation or anticipation.",
        "Mirrors and salon decor highlighting the environment.",
        "Hairstylist using scissors or clippers on a client's hair.",
        "Visible sections of hair being cut or styled.",
        "Mirror reflecting both stylist and client for feedback.",
        "Salon environment with tools and products easily accessible.",
        "Client’s expressions conveying trust or anticipation.",
        "Hairdresser with scissors or clippers, focused on a client’s hair.",
        "Hair falling away visibly as the haircut progresses.",
        "Client’s expression possibly showing relaxation or anticipation.",
        "Salon setting featuring mirrors, tools, and hair products.",
        "Stylists in professional attire, indicating the environment.",
        "Barber or stylist actively cutting hair with scissors or clippers.",
        "Hair falling onto the cape or floor, indicating the cutting process.",
        "Mirrors reflecting customer’s face, showcasing style change.",
        "Surrounding salon environment filled with tools and products.",
        "Variety of styles potentially visible as prior haircuts on display."
    ],
    "Hammer Throw": [
        "An athlete swinging a hammer (ball attached to a wire) in preparation for the throw.",
        "Focus on the athlete's balance and positioning within the throwing circle.",
        "Distinctive hammer equipment visible, emphasizing weight and size.",
        "Field markings indicating throwing boundaries clear in the background.",
        "Athletic attire and footwear highlighting performance aspects.",
        "Athlete gripping a hammer, poised to throw.",
        "Distinctive throwing circle and cage setup for safety.",
        "Athletic gear and shoes highlighted for performance.",
        "Stride and body posture emphasizing strength and technique.",
        "Spectators or fellow athletes captured in backdrop.",
        "Athlete winding up with a heavy hammer in hand.",
        "Focus on the circular motion of the hammer throw.",
        "Disciplined stance and strength on display.",
        "Throwing sector marked clearly on the field or area.",
        "Scoreboard or competition surroundings often visible.",
        "Athlete in a strong stance with a hammer weight held, preparing for the throw.",
        "Circular throwing area visible, often surrounded by a net.",
        "Focused facial expression, showcasing concentration and effort.",
        "Throwing implement highlighted, typically a heavy ball on a chain.",
        "Track and field background, indicating competitive environment.",
        "Athlete in stance, preparing to release the hammer in a circular motion.",
        "Hammer clearly held with both hands, showcasing grip.",
        "Throwing area with circular field markings evident in the background.",
        "Expression of focus and intensity visible on the thrower's face.",
        "Spectators or officials positioned around the throwing area."
    ],
    "Hammering": [
        "A person striking a nail into wood using a hammer.",
        "Focus on the action of the hammer coming down, showcasing force.",
        "Hard surface (wood) and nails prominently featured in the scene.",
        "Tool details such as a hammer's head and grip are visible.",
        "Surrounding area may contain other tools or construction materials.",
        "Hammer in a striking motion against a nail or object.",
        "Close-up of hand placement, emphasizing technique and force.",
        "Workspace visible with tools and materials surrounding.",
        "Action captured in motion, emphasizing impact and focus.",
        "Wood or metal surface being worked on clearly depicted.",
        "Individual using a hammer on a nail or material, often wood.",
        "Motion captured with the hammer in mid-swing.",
        "Focus on hand positioning and tools involved.",
        "Background may include a workbench or construction area.",
        "Safety goggles or gloves often visible for protection.",
        "Hammer held aloft, poised above a nail or piece of wood.",
        "Body in a poised position, indicating physical effort and correct form.",
        "Woodwork or construction material visible in the background.",
        "Possible protective gear like goggles worn, emphasizing safety.",
        "Surrounding tools or objects, indicating a working environment.",
        "Hammer being swung down, focused on impact against a surface.",
        "Nails or materials visible where the hammer is applied.",
        "Workers or builders often depicted in construction settings.",
        "Potential sparks or visual effects showcasing the force of the strike.",
        "Tools and building materials present in the background."
    ],
    "Hand Stand Pushups": [
        "A person in a handstand position with feet in the air preparing to push up.",
        "Focus on upper body strength, balancing on hands, showcasing core engagement.",
        "Gym or workout environment often evident around the athlete.",
        "Expressions of concentration clearly seen on the athlete’s face.",
        "Movement capturing the transition from handstand to push-up position.",
        "Individual in a handstand position, body aligned vertically.",
        "Close-up detail on form showing muscle engagement.",
        "Potential use of a mat or floor surface depicted.",
        "Facial expression indicating effort and concentration.",
        "Environment may include gym or outdoor setting.",
        "Individual performing a pushup while in a handstand position.",
        "Core and arm muscles visibly engaged and straining.",
        "Body alignment straight and vertically oriented.",
        "Possible gym or fitness area as the setting.",
        "Visual emphasis on balance and strength required to maintain position.",
        "Individual in a vertical handstand position against a wall or free-standing.",
        "Focus on muscle engagement, showcasing arm and shoulder strength.",
        "Gym or home workout background visible, indicating exercise setting.",
        "Feet pointed or flexed, indicating control and balance.",
        "Concentrated expression highlighting effort and technique involved.",
        "Individual positioned upside-down against a wall or on the ground.",
        "Clear muscle engagement visible in arms and core during the push-up.",
        "Potential supportive surface visible, indicating stability.",
        "Focused expressions highlighting strength and balance.",
        "Gym or workout environment surrounding the individual."
    ],
    "Handstand Walking": [
        "A person balancing on hands, legs in the air while walking.",
        "Dynamic posture capturing the act of walking on hands, emphasizing balance.",
        "Background may show gym or outdoor space suitable for acrobatics.",
        "Athletic attire utilized for flexibility prominently displayed.",
        "Facial expression can showcase concentration and playful focus.",
        "Individual balancing in a handstand, moving forward.",
        "Arms and legs extended, showing control and flexibility.",
        "Ground surface highlighted to illustrate support.",
        "Expression of focus or joy captured during movement.",
        "Background may include fellow athletes or spectators.",
        "Individual balancing on hands while walking on arms.",
        "Distinct upside-down view of the body during movement.",
        "Gym environment often highlighted to indicate skill.",
        "Possible audience in the background, watching the skill.",
        "Focus on body control and skill in the movement.",
        "Individual in a handstand position, balancing on hands while walking.",
        "Focused expression of concentration and balance.",
        "Background showing gradient levels, indicating exercise space.",
        "Arms fully extended, emphasizing posture and alignment.",
        "Body in motion, potentially with slight movement blur captured.",
        "Person balancing on hands while walking, showcasing athletic ability.",
        "Body posture elongated, emphasizing core strength.",
        "Ground surface specified, such as a gym floor or outdoor setting.",
        "Hand placement precise, indicative of control and balance.",
        "Spectators often visible, observing the impressive skill."
    ],
    "Head Massage": [
        "A person receiving a head massage, often seated or reclining.",
        "Focus on hands applying pressure or kneading the scalp.",
        "Relaxed expression on the recipient’s face, suggesting relief or calm.",
        "Soft lighting and tranquil environment enhancing the soothing atmosphere.",
        "Hair may be visible, showcasing different styles in the context of the massage.",
        "Individual seated or lying down, visibly relaxed.",
        "Hands of the masseuse placed carefully on the scalp.",
        "Lighting soft, enhancing an atmosphere of tranquility.",
        "Facial expressions showing peace or enjoyment.",
        "Massage oils or tools may be featured nearby.",
        "Person receiving a head massage, often in a relaxed posture.",
        "Hands of the massager clearly manipulating the scalp.",
        "Atmospheric setting possibly including aromatherapy or soft lighting.",
        "Close-up focus on the head, showing tranquility and comfort.",
        "Hair texture might be highlighted, displaying relaxation.",
        "Hands positioned on the head, gently massaging the scalp.",
        "Person receiving the massage appears relaxed or content.",
        "Spa or home environment with calming elements in the background.",
        "Close-up focus on the movements, showing technique and care.",
        "Possibly aromatic oils or products visible, indicating a sensory experience.",
        "Head and shoulders depicted as hands manipulate the scalp.",
        "Relaxed facial expression indicating enjoyment and calmness.",
        "Potential oils or products visible in the background.",
        "Spa or wellness environment enhancing the relaxing visuals.",
        "Close-up focus on hair texture and physical interactions."
    ],
    "High Jump": [
        "An athlete in mid-air, jumping over a high bar with a specific technique.",
        "Focus on the bar and the height being cleared, creating a dynamic visual.",
        "Body position indicated, showcasing the arch and lift during the jump.",
        "Track and field environment, including audience and event infrastructure visible.",
        "Athletic attire may reflect team colors or personal branding prominently.",
        "Athlete in mid-air, jumping over a high bar.",
        "Distinctive clothing and shoes enhancing athletic identity.",
        "Setup includes high jump mat and supportive surroundings.",
        "Dynamic motion showcasing the arc of the jump.",
        "Crowd or judges in the background enhancing the competitive context.",
        "Athlete preparing to leap over a high bar.",
        "Vertical motion captured, showing take-off and form.",
        "Landing area with mats or pit to soften the fall.",
        "Attention on the height of the bar and athlete's posture.",
        "Scenic background may reflect an outdoor or indoor athletic field.",
        "Athlete in mid-air, jumping over a bar, showcasing lifting technique.",
        "Use of a pole vault or high jump mat visible below.",
        "Focused facial expression, illustrating concentration and effort.",
        "Background athletes or spectators present, indicating competition.",
        "Track and field setting, highlighting the event's environment.",
        "Athlete leaping over a horizontal bar, demonstrating agility.",
        "Clear athletic posture showcased during the jump.",
        "Bar and landing mat visually depicted beneath the jumper.",
        "Spectators or judges potentially visible in a field setting.",
        "Running start visible, indicating approach prior to the jump."
    ],
    "Horse Race": [
        "Jockeys riding horses, often depicted in full gallop.",
        "Focus on the horses’ muscles and form, highlighting speed and strength.",
        "Track environment with other horses and a number of spectators in sight.",
        "Jockey gear, including bright silks and helmets, showcases identity.",
        "Motion depicted, often showing the thrill of competition.",
        "Horses in full gallop, showcasing strength and speed.",
        "Jockeys dressed in colorful silks, clearly visible.",
        "Track and turf highlights the racing environment.",
        "Spectators in the background capturing excitement.",
        "Motion blur may depict the rapid pace of the race.",
        "Multiple horses and jockeys in dynamic racing positions.",
        "Track visible with spectators in the background cheering.",
        "Colorful jockey outfits adding vibrancy to the scene.",
        "Fast motion captured, showing the speed and excitement.",
        "Timing apparatus or markers along the racetrack may be evident.",
        "Jockey on a horse, capturing the dynamic motion of racing.",
        "Multiple horses in parallel competitive motion, highlighting speed.",
        "Unique racing silks worn by jockeys, showcasing team identification.",
        "Track visuals with spectators cheering in the background.",
        "Potential for motion blur around the horses emphasizing speed.",
        "Horses in full stride, showcasing speed and athleticism.",
        "Jockeys in colorful attire, actively competing.",
        "Race track with spectators and signage lining the sides.",
        "Dynamic action captured through mud or dust kicked up by horses.",
        "Finish line flags or banners marking the racing course."
    ],
    "Horse Riding": [
        "A person mounted on a horse, showcasing riding posture and control.",
        "The horse's movement captured, illustrating grace and coordination.",
        "Riding gear, including saddles and bridles, highlighted in clarity.",
        "Environment may include trails, fields, or arenas, presenting context.",
        "Expressions of concentration or enjoyment on the rider’s face clear.",
        "Rider positioned atop a horse, showcasing balance.",
        "Close view of horse’s strong physique and saddle details.",
        "Outdoor setting, like a field or riding arena visible.",
        "Rider’s outfit may include helmets and riding gear.",
        "Movement captured indicating partnership between horse and rider.",
        "Rider mounted on a horse, demonstrating control and posture.",
        "Saddle and reins visually prominent, indicating riding position.",
        "Horse’s breed and color become a focal point in the setting.",
        "Outdoor environment with fields or arenas, enhancing the scene.",
        "Rider dressed in appropriate equestrian attire.",
        "Rider mounted on a horse, showcasing riding posture and control.",
        "Horse's features—mane, tail, and saddle—prominent in the image.",
        "Outdoor setting, with lush fields or riding arena visible in background.",
        "Rider's outfit typically including boots, hat, or riding gear.",
        "Body language indicating communication and connection between horse and rider.",
        "Horse's mane and tail flowing, indicating movement.",
        "Riding attire like helmets and boots visible on the rider.",
        "Outdoor or arena setting typically characterized by fences or jumps.",
        "Bond between rider and horse visible through expressions and body language.",
        "Rider on horseback in various positions, showing control."
    ],
    "Hula Hoop": [
        "A person spinning a hula hoop around their waist, captured in motion.",
        "Lay of the colors and patterns on the hoop distinctively visible.",
        "Body movement and posture highlighted reflecting coordination.",
        "Possibly an outdoor or performance setting, illustrating a playful vibe.",
        "Facial expressions showing enjoyment or focus prominently featured.",
        "Individual with a colorful hoop around their waist or arms.",
        "Motion captured showing the circular movement of the hoop.",
        "Bright, vibrant clothing may enhance the joyful atmosphere.",
        "Environment could include a park or gym setting.",
        "Expressions of fun or concentration depicted showcasing skill.",
        "Individual gracefully twirling a colorful hula hoop around their waist.",
        "Movement captured, often with limbs extended for balance.",
        "Bright colors and patterns of the hoop contrasting against the background.",
        "Expressions of joy or concentration as the hoop spins.",
        "Outdoor or recreational setting with space clearly defined.",
        "Individual spinning a hoop around their waist, capturing movement.",
        "Brightly colored hoop contrasting with the person’s attire.",
        "Focus on the torso and hips, indicating rhythm and coordination.",
        "Outdoor or spacious indoor setting highlighting playful environment.",
        "Laughing or smiling expressions, emphasizing enjoyment.",
        "Individual in motion with a hula hoop around their waist.",
        "Colorful hoop featuring patterns or designs during rotations.",
        "Dynamic body movements showcased, emphasizing rhythm.",
        "Smiling expressions indicating enjoyment of the activity.",
        "Outdoor environment like beaches or parks enhancing the visual appeal."
    ],
    "Ice Dancing": [
        "Two dancers performing on ice, showcasing synchronized movements.",
        "Elegant attire, typically sequined or costume-like, greatly embellishes dancers.",
        "Ice rink details that highlight the environment, including audience in background.",
        "Intricate footwork captured, emphasizing grace and athleticism.",
        "Mood conveyed through expressions and postures, suggesting a narrative performance.",
        "Dancers on ice showcasing elegant moves and holds.",
        "Skating outfits featuring sequins or bright colors.",
        "Ice rink setup highlighting artistic performance.",
        "Poses emphasizing balance, rhythm, and synchronization.",
        "Spectators around the rink enhancing the spectacle.",
        "Pair of dancers performing synchronized movements on ice.",
        "Elegant costumes with flowing materials showcasing grace.",
        "Ice skates clearly visible, emphasizing their skating technique.",
        "Ice surface reflecting lights, enhancing the visual appeal.",
        "Audience or judges in the background may be present, watching the routine.",
        "Pairs of dancers on ice in coordinated poses or routines.",
        "Elegant costumes worn, often flowing and colorful.",
        "Ice surface visible with possible blurred audience in background.",
        "Facial expressions of joy and concentration from the dancers.",
        "Dance movements captured, showcasing twirls or spins in mid-action.",
        "Couples gliding smoothly on ice, showcasing choreography.",
        "Colorful costumes designed for aesthetics and movement.",
        "Ice rink setting with surrounding spectators and lighting.",
        "Focus on movements like spins, lifts, and intricate footwork.",
        "Expressions of grace and coordination visibly communicated."
    ],
    "Javelin Throw": [
        "An athlete preparing to throw a javelin, showcasing strength and technique.",
        "Focus on the javelin's aerodynamic shape, emphasizing the throwing motion.",
        "Athletics field markings clearly visible, providing context for the event.",
        "Body positioning critical to the throw, highlighted with visible muscles.",
        "Audience or other competitors in the background contribute to the scene's action.",
        "Athlete poised to launch a javelin, showcasing form.",
        "Javelin's aerodynamic design prominently displayed.",
        "Field or track setup with distance markers visible.",
        "Athletic clothing emphasizing action-oriented design.",
        "Focus on body mechanics captured in dynamic motion.",
        "Athlete in motion preparing to release the javelin.",
        "Long, slender javelin clearly positioned for the throw.",
        "Stadium setting with spectators encouraging the competition.",
        "Focus on the athlete's form, posture, and momentum.",
        "Markers or sector lines showing the landing area for the throw.",
        "Athlete in the act of throwing, showcasing form and technique.",
        "Javelin in the air, emphasizing distance and trajectory.",
        "Stadium or track field environment clearly visible.",
        "Focused expression depicting concentration on the throw.",
        "Ground area marked with throwing lines, indicating sport context.",
        "Athlete poised to throw the javelin, showcasing grip and form.",
        "Length of the javelin highlighted in the thrower's hand.",
        "Field markings evident indicating throwing sector.",
        "Spectators and team members potentially supporting in the background.",
        "Concentrated expression indicating the intensity of the throw."
    ],
    "Juggling Balls": [
        "A juggler actively tossing multiple balls in the air, often with varied colors.",
        "Focus on the hands in motion, showcasing dexterity and coordination.",
        "Expressions of concentration and enjoyment on the juggler’s face.",
        "Surrounding environment may include performance setting with attendees.",
        "Background movement captured through dynamic angles or levitating balls.",
        "Juggler's hands tossing multiple colorful balls in the air.",
        "Motion captured illustrating skill and coordination.",
        "Bright colors of balls enhancing visual appeal.",
        "Performer’s expression showing focus and engagement.",
        "Background may include audience or stage environment.",
        "Performer tossing multiple balls in the air with rhythm.",
        "Colorful balls providing vibrant contrast against the performer or background.",
        "Focus on hand coordination and eye movement during the act.",
        "Expressions of concentration and enjoyment visibly portrayed.",
        "Might include audience reactions or performers dressed in unique attire.",
        "Performer with multiple balls in the air, showcasing skill and rhythm.",
        "Dynamic body movements highlighted to maintain balance.",
        "Colorful balls contrasting against the performer’s attire or background.",
        "Wide-eyed expression indicating focus and enjoyment.",
        "Audience or street performers in the background, indicating a lively environment.",
        "Performer actively tossing multiple balls in mid-air.",
        "Focus on hand movements and coordination displayed.",
        "Colorful balls contrasting with the performer’s attire.",
        "Dynamic expressions of concentration and joy during the act.",
        "Potential audience visible, showcasing engagement with the performance."
    ],
    "Jump Rope": [
        "A person mid-skip with a jump rope in hands, showcasing activity.",
        "The rope captured mid-air, often creating a wave or loop effect.",
        "Focus on foot movement, highlighting agility and coordination.",
        "Outdoor or gym environment often prominent in the background.",
        "Bright workout attire highlighting the energetic nature of the activity.",
        "Individual mid-jump with a rope in motion.",
        "Rope’s handle visible, showcasing grips in use.",
        "Dynamic pose emphasizing rhythm and timing.",
        "Potential outdoor or gym environment visible.",
        "Expressions of effort and enjoyment captured in action.",
        "Individual skipping rope, with clearly visible movement rhythm.",
        "Rope depicted in motion, highlighting speed and agility.",
        "Jumping posture, with feet elevated above the ground.",
        "Outdoor or gym setting may be depicted, often with bright colors.",
        "Possible other jumpers or equipment in the background, implying a group activity.",
        "Individual in mid-air, illustrating the dynamic motion of jumping.",
        "Rope visible in motion, showcasing rhythm and timing.",
        "Athletic wear highlighting active workout or playful engagement.",
        "Concrete or gym flooring in the background indicating setting.",
        "Facial expressions of enjoyment or effort, emphasizing fitness.",
        "Individual mid-skipping, with the rope visibly in motion.",
        "Clear footwork indicating rhythm and coordination.",
        "Jump rope features highlighted as it swings in the air.",
        "Expressions of concentration or enjoyment displayed on the face.",
        "Dynamic posture emphasizing strength and agility."
    ],
    "Jumping Jack": [
        "A person engaged in a jumping jack, arms and legs extended in motion.",
        "Clear representation of synchronization and physical fitness in action.",
        "Outdoor or gym setting may provide context for the workout.",
        "Facial expressions can reflect effort or enjoyment during exercise.",
        "Workout attire may be brightly colored, matching the energetic vibe.",
        "Individual in mid-air with limbs extended, showcasing exercise.",
        "Tracksuit or athletic wear prominently displayed.",
        "Ground surface depicted, showing contact and movement.",
        "Background may include gym setting or nature.",
        "Expressions of exertion or joy in vigorous activity emphasized.",
        "Individual in mid-air position, with arms and legs spread apart.",
        "Dynamic motion captured, highlighting aerobic activity.",
        "Outdoor or fitness setting with clear ground markings.",
        "Focus on facial expressions showing effort or enthusiasm.",
        "Athletic clothing typically visible, emphasizing workout context.",
        "Individual in a jumping motion, legs spread wide and arms raised overhead.",
        "Athletic clothing worn, emphasizing movement and physicality.",
        "Open space around the individual, indicating workout environment.",
        "Concentrated facial expression showcasing effort and activity.",
        "Motion blur or distortion captured, illustrating movement speed.",
        "Person executing jumping jacks, arms and legs in motion.",
        "Body posture dynamic, showcasing full-range movements.",
        "Exercise attire highlighting fitness environment.",
        "Clear floor or ground surface indicating activity area.",
        "Group dynamics can be visible if performed with others."
    ],
    "Kayaking": [
        "A kayaker paddling on water, often captured in a dynamic stroke.",
        "Kayak shape and colors clearly visible, indicating the type of craft.",
        "Water movement illustrating splashes from the paddles.",
        "Natural surroundings such as rivers or lakes creating scenic context.",
        "Safety gear (like life jackets) prominently featured, emphasizing safety awareness.",
        "Kayaker in a brightly colored kayak navigating through water.",
        "Paddle in mid-stroke depicting action and movement.",
        "Water splashes around the kayak, enhancing dynamic scene.",
        "Natural settings like rivers or lakes providing context.",
        "Expression of focus or thrill on the kayaker’s face.",
        "Kayaker positioned in a kayak, paddling through water.",
        "Paddle raised, either in motion or striking the water.",
        "Surrounding scenery may include rivers, lakes, or forests.",
        "Water splashes and movement indicating speed and direction.",
        "Life jackets often visible, ensuring safety during the activity.",
        "Individual in a kayak, paddle raised above water with focused movement.",
        "Water surface visibly splashing around the kayak, indicating motion.",
        "Scenic background of nature or water bodies, showcasing an outdoor setting.",
        "Relevant safety gear like life jackets visible on the kayaker.",
        "Dynamic body posture indicating strength and balance in paddling.",
        "Kayaker in a boat, paddling through water, emphasizing motion.",
        "Ripples or waves seen around the kayak, showcasing water interaction.",
        "Paddles held firmly, displaying necessary equipment.",
        "Surrounding scenery like rivers, lakes, or coastal regions evident.",
        "Focus on form and control while navigating."
    ],
    "Knitting": [
        "A person holding knitting needles with yarn, showcasing technique.",
        "Focus on the hands interacting with the yarn, creating a knitted piece.",
        "Various colors and textures of yarn visible, showcasing the craft's diversity.",
        "The atmosphere often cozy, with background elements like cushions or light.",
        "Expression of concentration on the knitter's face clearly captured, reflecting enjoyment.",
        "Hands positioned with knitting needles and yarn in action.",
        "Close view of colorful yarns on a cozy setting.",
        "Patterns being formed visibly showing progress.",
        "Relaxed or focused facial expressions captured.",
        "Background may include a comfortable chair or crafting area.",
        "Individual holding knitting needles, with yarn visible.",
        "Focus on hands in motion, creating loops or stitches.",
        "Finished or partially finished piece being showcased.",
        "Cozy indoor setting, often with patterns or colorful yarn.",
        "Expression of concentration and creativity apparent on the knitter's face.",
        "Individual with knitting needles in hand, actively creating a pattern.",
        "Yarn vividly colored, typically rolling in the foreground or background.",
        "Comfortable sitting position, often in a warm, cozy environment.",
        "Close focus on hands, showcasing technique and teamwork of fingers.",
        "Background possibly filled with knitting projects or tools, indicating hobby space.",
        "Hands actively working with yarn and needles, showcasing technique.",
        "Piece of knitted fabric or project partially visible in progress.",
        "Varied textures and colors of yarn creating a colorful visual.",
        "Calm expressions indicative of concentration during the craft.",
        "Surroundings including tools, patterns, or finished pieces can be visible."
    ],
    "Long Jump": [
        "Athlete generally takes a running start before leaping.",
        "Sand pit clearly visible at the end of the jump area.",
        "Legs extended forward during the jump, often in a split position.",
        "Focus on horizontal distance rather than vertical height.",
        "Takeoff board may be marked, and athlete's foot position is critical.",
        "Athlete positioned in a running stance or take-off position.",
        "Sand pit visible below, indicating the landing area.",
        "Body stretches forward during the jump with arms extended.",
        "Dynamic motion captured, showing the leap through the air.",
        "Often features a competition setting, like a track field.",
        "Athletes take off from a solid board or surface with a running start.",
        "Body positions are dynamic, often with legs extended during flight.",
        "Landing is typically on a sandpit, creating a visible pile of sand.",
        "Athletes may wear specialized shoes with spikes for traction.",
        "The runway is straight and long, leading up to the jump area.",
        "Athlete in a sprinting position, usually with one leg extended forward and the other leg bent.",
        "Arms often raised or positioned for balance during the jump.",
        "A takeoff board or pit may be visible in the background.",
        "Typically occurs on a track surface, showing defined lanes.",
        "Athlete’s body in mid-air or just above the sand pit.",
        "Athlete takes off from a board, usually with one foot.",
        "Distinct sandpit at the end of the jump area for landing.",
        "Running approach with a stretched-out posture.",
        "Possible motion blur indicating speed during takeoff.",
        "Typically involves an athlete in a dynamic, airborne position."
    ],
    "Lunges": [
        "Athlete in a position with one leg forward and the other leg back.",
        "Knees bent, with the forward knee often over the ankle.",
        "Upper body typically upright with arms either in motion or held steady.",
        "Clear emphasis on balance with a stable center of gravity.",
        "Often done in a gym or fitness environment, showcasing mats or weights.",
        "Individual in a split stance with one leg forward and one leg back.",
        "Bent front knee with a straight back leg.",
        "Upper body upright, often with hands on hips or at the sides.",
        "Floor surface visible, showing foot placement.",
        "May include gym or exercise equipment in the background.",
        "Body posture involves one knee bent forward and the other leg extended straight back.",
        "Hands can be positioned on hips or held in front for balance.",
        "Typically performed on a flat surface, often in a gym or exercise space.",
        "Clothing is usually athletic, such as leggings or shorts.",
        "The movement is repetitive and often involves an upright torso.",
        "Individual in a split stance, one leg extended forward and the other leg bent backward.",
        "Body weight visibly shifted forward onto the front leg.",
        "Arms may be positioned at sides or raised for balance.",
        "Often seen on a gym or exercise mat surface.",
        "Front knee usually positioned over the ankle.",
        "Athlete in a one-legged forward bent position.",
        "Front leg is extended, while the back leg is bent.",
        "Can be performed with weights, indicated by visible dumbbells.",
        "Often shows a focused or straining facial expression.",
        "Usually takes place on a flat surface, contrasting with the balance beam."
    ],
    "Military Parade": [
        "Rows of uniformed soldiers in precise formation.",
        "Use of flags and weapons prominently displayed.",
        "Clear, synchronized movements and marching styles.",
        "Presence of a reviewing stand or dignitaries observing.",
        "Often features ceremonial uniforms with distinct insignia.",
        "Groups of uniformed personnel marching in formation.",
        "Flag bearers, drums, and other military symbols visible.",
        "Parading on a street or open area, possibly with spectators.",
        "Use of weaponry or ceremonial items, like rifles or swords.",
        "Vibrant colors of uniforms displayed prominently.",
        "Uniformed personnel in formation, often with synchronized movements.",
        "Presence of flags, banners, and military equipment (e.g., tanks).",
        "Striking and rigid postures, with footwear often polished and matching.",
        "Typically performed on a wide, open area, such as a square or street.",
        "Visual elements include precision and order, with distinct ranks and files.",
        "Soldiers in formation, often wearing uniforms and carrying flags or rifles.",
        "Clearly defined lines of troops marching in unison.",
        "The presence of military vehicles or bands in the background.",
        "Spectators may be visible watching the parade.",
        "Often takes place on a wide, open street or parade ground.",
        "Rows of uniformed soldiers in synchronized formations.",
        "Presence of flags, weapons, and formal attire.",
        "Structured and organized appearance with a sense of discipline.",
        "Clear pathways or streets lined with spectators.",
        "Can include vehicles such as tanks or military trucks."
    ],
    "Mixing": [
        "Bowls or containers with various ingredients or colors visible.",
        "Mixing tools such as spatulas or whisks prominently displayed.",
        "Action often shows motion, like blending or stirring.",
        "Ingredients may vary greatly in texture and color.",
        "Background sometimes includes kitchen utensils or appliances.",
        "Individual using a mixing bowl and a utensil, like a whisk or spoon.",
        "Ingredients visibly being mixed, possibly flour or batter.",
        "Kitchen countertop visible, suggesting a domestic setting.",
        "Motion captured, showing swirling or stirring action.",
        "Often colorful ingredients with a dynamic play of textures.",
        "Ingredients in a bowl or container, often with a visible mixer or whisk.",
        "Colorful display of various food items or liquids being combined.",
        "Action often shows a circular motion or up-and-down mixing, creating movement.",
        "Use of kitchen tools like spatulas and measuring cups prominently.",
        "Background may include counters, measuring ingredients, or recipe sheets.",
        "Person using a mixing bowl or container with a stirring utensil.",
        "Ingredients such as batter or liquid may be visible in the bowl.",
        "Motion of stirring or whisking usually depicted.",
        "Often features splatters or ingredients on the surrounding surface.",
        "Kitchen tools and appliances are likely present in the scene.",
        "Presence of bowls, mixers, or other kitchen utensils.",
        "Ingredients such as flour or batter being combined visually.",
        "Action of pouring or stirring, often shown in a dynamic manner.",
        "Variety of colors and textures from different ingredients.",
        "Typically set in a kitchen environment with food-related items."
    ],
    "Mopping Floor": [
        "Mop with visible strands, often dripping with cleaning solution.",
        "Satisfaction of shine or cleanliness on the floor surface.",
        "Person in a bent over position, often wet or soapy areas visible.",
        "Cleaning bucket and floor cleaning supplies usually nearby.",
        "Floor surface may be tile, wood, or laminate, showing clear differences.",
        "Individual using a mop on a visible floor surface.",
        "Buckets and cleaning supplies evident in the scene.",
        "Water splashes or cleaning solution visible on the floor.",
        "Motion of the mop captured, indicating action.",
        "Often features a household or commercial space setting.",
        "Mop and bucket visibly present, often with water or cleaning solution.",
        "The action typically includes a bent over posture, manipulating the mop.",
        "Wet floor appearance with reflections or sheen on the surface.",
        "Clothing may include protective gear or practical cleaning attire.",
        "Surroundings often contain furniture being moved or avoided.",
        "Individual holding a mop, typically in a bent posture.",
        "Wet floor visible, often with reflections from the liquid.",
        "Bucket or cleaning supplies nearby.",
        "Action of the mop moving across the floor.",
        "Presence of a clean or dirty floor area shown in contrast.",
        "Use of mop and bucket, often including visible water or cleaning solution.",
        "Person in a bent-over posture, actively cleaning.",
        "Floor surface showing signs of wetness or sheen after mopping.",
        "Potentially includes cleaning cloths or additional tools nearby.",
        "Domestic environment with furniture or walls as backdrop."
    ],
    "Nunchucks": [
        "Two sticks connected by a chord, held in a fluid motion.",
        "Dynamic posture of the user, often in martial arts attire.",
        "Visible motion blur may indicate speed and agility of the nunchuck.",
        "Focus on hand positioning and grip during a demonstration.",
        "Background may highlight a dojo or training environment.",
        "Individual holding or performing with nunchucks.",
        "Fluid motion captured, demonstrating skill and flexibility.",
        "A clear focus on the nunchucks with hands in action.",
        "Possible martial arts attire worn by the practitioner.",
        "Background may include dojo or training area.",
        "A pair of connected sticks, often in motion or poised for action.",
        "Visible hand movements showcasing skill and technique.",
        "Motion lines may suggest speed or swirling action.",
        "Typically includes a martial arts uniform (gi) or workout attire.",
        "Background may feature a dojo or training area decorated with martial arts motifs.",
        "Individual holding a pair of nunchucks, typically in a dynamic stance.",
        "Motion blur may indicate swinging or twirling action.",
        "Possible focus on the martial artist’s attire.",
        "Background may hint at a dojo or training area.",
        "Posture often indicates concentration or skill in martial arts.",
        "Two sticks connected by a chain or rope.",
        "Dynamic motion, with possible motion blur indicating speed.",
        "Athlete's hands gripping the nunchucks, often in a combat stance.",
        "A wide stance or martial arts outfit commonly depicted.",
        "Background may include a dojo or training environment."
    ],
    "Parallel Bars": [
        "Two horizontal bars parallel to each other.",
        "Athlete performing either support holds, swings, or dismounts.",
        "Emphasis on upper body strength and control.",
        "Gymnastics attire often features distinct colors or designs.",
        "Surrounding area usually includes padding for safety.",
        "Gymnast in mid-air above the parallel bars.",
        "Parallel bars clearly defined, with a focused background.",
        "Body in an athletic pose, showcasing strength and balance.",
        "Possible audience or coaching staff observing.",
        "Bright gym floor or mat visible below.",
        "Athletes performing stunts between two horizontal bars.",
        "Body suspended between the bars, often displaying strength and balance.",
        "Bars are usually metallic and elevated above a mat or floor.",
        "The action may exhibit a wide range of positions, including inverted or swinging.",
        "Surroundings might include gym equipment and supportive mats.",
        "Gymnast positioned between two horizontal bars, performing a skill.",
        "Body may be in a horizontal or inverted position.",
        "Emphasis on arm strength and balance.",
        "Equipment usually features a floor mat underneath.",
        "Potential audience in the background watching the performance.",
        "Two horizontal bars elevated off the ground.",
        "Gymnasts positioning themselves, often in a support or swing.",
        "Potential for visible body tension and movement in mid-air.",
        "Use of chalk for grip, indicated by white residues on hands.",
        "Gym setting with mats or equipment in the background."
    ],
    "Pizza Tossing": [
        "Pizzaiolo with hands raised, tossing dough in the air.",
        "Flour dust visibly surrounding the working area.",
        "Circling motion of dough creating a dynamic effect.",
        "Background often shows pizza ingredients or a wood-fired oven.",
        "Bright colors of toppings usually showcased on the table.",
        "Individual tossing pizza dough into the air.",
        "Flour dust particles visible around the dough.",
        "Brightly colored pizza ingredients in the background.",
        "Dynamic motion showing the circular shape of the dough.",
        "Possible pizzeria setting with other food items around.",
        "Dough being tossed into the air, showcasing a circular shape.",
        "Chef's hands visibly working with the dough, often flour coated.",
        "Usage of a pizza peel or work surface in the foreground.",
        "Ingredients (sauce, cheese) may be seen ready for application in the background.",
        "Typically a lively kitchen setting with bright colors and movement.",
        "Chef visibly tossing pizza dough in the air.",
        "Round shape of dough highly emphasized mid-flight.",
        "Flour or toppings may be scattered around the workspace.",
        "Excited expressions commonly shown on the chef's face.",
        "Kitchen setting with various pizza-making tools and ingredients visible.",
        "Chef's hands in mid-air tossing a raw pizza dough.",
        "Circular shaped dough, often shown in a stretched form.",
        "Flour dust may be visible, indicating a cooking environment.",
        "Enthusiastic facial expression or focus on the chef's skills.",
        "Kitchen or pizzeria setting, with other ingredients in view."
    ],
    "Playing Cello": [
        "Tall, wooden instrument held between the knees.",
        "Bow moving across strings, creating a visual motion.",
        "Player often uses a seated, relaxed posture.",
        "Expression of concentration and engagement on the musician’s face.",
        "Background may show orchestral setup or performance lights.",
        "Musician seated with a large cello between knees.",
        "Bow in hand, making contact with cello strings.",
        "Sheet music visible, possibly on a stand nearby.",
        "Facial expressions conveying concentration and emotion.",
        "Indoor concert or practice setting visible.",
        "Cello body prominently featured, held between the player’s knees.",
        "Bow in motion across the strings, showing a contrasting white or wooden color.",
        "Hands positioned skillfully on the fingerboard.",
        "Music stand with sheet music may be visible nearby.",
        "The player often sits while focusing on the instrument, creating a serene setting.",
        "Musician seated, holding a cello between their knees.",
        "Bow in hand, typically moving across the strings.",
        "Focused expression on the musician's face.",
        "Cello body prominently displayed, showcasing its curves.",
        "Sheet music may be present on a stand nearby.",
        "Large wooden cello resting against the player's body.",
        "Bow in motion across the strings, creating a visual line.",
        "Player in a seated position, often with a focused expression.",
        "Distinct curvature of the cello body, contrasting with the player.",
        "Background may include music stands or musicians in an ensemble."
    ],
    "Playing Daf": [
        "Large circular frame drum with decorative design.",
        "Musician using hands to produce rhythmic beats.",
        "Vibrant clothing, sometimes traditional, worn by the player.",
        "Visible motion of fingers tapping against the drum skin.",
        "Setting often includes cultural or traditional elements.",
        "Musician holding a large, circular frame drum (daf).",
        "Hand movement evident as the individual strikes the drum.",
        "Decorations on the daf surface, indicating craftsmanship.",
        "Cultural attire or elements in the background.",
        "Typically captures an expression of rhythm and energy.",
        "Circular frame drum held in hand, often with fingers striking the surface.",
        "Decorations or symbols visible on the drum’s face.",
        "Performer may be in a dynamic posture, emphasizing rhythm.",
        "Surroundings can include cultural elements, like textiles or other musicians.",
        "Often accompanied by vibrant, traditional attire.",
        "Musician holding the daf at an angle, striking the drum surface with hands.",
        "Circular frame of the daf is decorated and visible.",
        "Vibrant movements of the musician’s hands indicated.",
        "Ethnic attire reflecting cultural significance often shown.",
        "Possible audience or other musicians in the background.",
        "Circular frame drum with jingles, held in one hand.",
        "Decorative patterns on the drum's surface, indicating artistry.",
        "Dynamic arm movement striking the drum, often shown.",
        "Cultural attire of the player may be visible in performance.",
        "Stage or traditional setting, with potential audience in the background."
    ],
    "Playing Dhol": [
        "Large double-headed drum held at chest level.",
        "Dynamic hand movements striking both sides of the drum.",
        "Bright and colorful attire, often with cultural significance.",
        "Visible energy and rhythm conveyed through body motion.",
        "Surroundings may include a festive atmosphere or group dancing.",
        "Musician with a large barrel drum, often slung over shoulder.",
        "Hands rapidly playing on the drum's surface.",
        "Vibrant colors associated with the dhol evident in the costume.",
        "Possible energetic dance or movement around the musician.",
        "Cultural performance setting often included.",
        "Large double-headed drum held with both hands for dynamic playing.",
        "Vibrant visuals often show the drummer's vigorous movements.",
        "The drum body is often elaborately decorated with bright colors.",
        "Surroundings may feature dancers or celebratory elements.",
        "The player's posture is usually energetic, reflecting the rhythm of the music.",
        "Individual drumming on a large, cylindrical dhol with both hands.",
        "Dynamic posture with an expressive face, showing rhythm and energy.",
        "Intricate patterns on the dhol skin emphasized.",
        "Cultural attire, such as colorful clothing, may be featured.",
        "Possibly accompanied by dancing or a group setting.",
        "Large double-sided drum held with straps or on hips.",
        "Bold, rhythmical striking action depicted with hands.",
        "Brightly colored drum with intricate patterns.",
        "Player often in traditional attire, energetically performing.",
        "Outdoor or festive atmosphere with musicians or dancers around."
    ],
    "Playing Flute": [
        "Long, slender instrument held horizontally.",
        "Player’s fingers moving quickly over the keys.",
        "Breath or air visible at the mouthpiece when played.",
        "Focused expression of the musician, enhancing emotional connection.",
        "Background may feature an orchestra or serene nature setting.",
        "Musician holding a cylindrical flute to their lips.",
        "Focus on finger placements along the flute's holes.",
        "Facial expression showing deep concentration.",
        "Possible concert or nature setting in the background.",
        "Light reflecting off the flute, indicating its glossy finish.",
        "Long, slender instrument held horizontally, with fingers positioned over holes.",
        "Breath visible as the player blows into the mouthpiece.",
        "Elongated body of the flute often glimmers in light, reflecting silver or gold.",
        "The musician usually stands or sits with an upright posture.",
        "Surrounding may include sheet music and other musicians or instruments.",
        "Musician holding a flute to their lips, blowing into it.",
        "Focus on the flute's slender, metallic body.",
        "Potentially expressive facial features indicating concentration.",
        "Musical notes may be illustrated in the background.",
        "Surroundings could be a concert stage or outdoor setting.",
        "Slim, elongated silver instrument held to the mouth.",
        "Finger positions clearly visible along the flute's body.",
        "Player's breath may be shown as sound waves or motion.",
        "Typically seated or standing with a focused posture.",
        "Soft lighting may highlight the instrument's sheen."
    ],
    "Playing Guitar": [
        "Fretted string instrument held against the body.",
        "Strumming or picking action clearly emphasized.",
        "Player seated or standing, often in a relaxed posture.",
        "Various strings and frets visible, showcasing technique.",
        "Background often includes microphones or stage lighting.",
        "Individual seated or standing with an acoustic or electric guitar.",
        "Strumming hand in action, possibly with visible chords.",
        "Close-up of fingers on the fretboard.",
        "Music sheets or an amplifier visible in the environment.",
        "Casual or concert setting often depicted.",
        "Guitar's body prominently displayed, often angled toward the audience.",
        "Fingers visibly pressing down on frets while strumming or picking.",
        "Sound hole of the guitar is a notable feature on the body.",
        "Typically includes a mix of casual or performance attire, depending on context.",
        "May include electric cables or amplifiers in the environment for electric guitars.",
        "Guitarist seated or standing, strumming or picking the guitar strings.",
        "Body of the guitar prominently visible, typically larger than the hands.",
        "Potentially vibrant setting with an audience or band.",
        "Hands in motion, captured during a chord transition.",
        "Possible music sheet or amplifier depicted in the background.",
        "Wooden or electric guitar held in a relaxed playing position.",
        "Visible hand positions on the fretboard during strumming or picking.",
        "Often shows body movement or swaying with the music.",
        "May feature an amplifier or effects pedals in the frame.",
        "Background can include the setting of a band or audience."
    ],
    "Playing Piano": [
        "Black and white keys visibly being pressed.",
        "Hands in motion, often over the keyboard.",
        "Detailed focus on player’s facial expressions and engagement.",
        "Sheet music may be present on the stand.",
        "Background often features a concert setting or recording studio.",
        "Pianist seated at a grand or upright piano, hands on keys.",
        "Sheet music displayed on the piano stand or desk.",
        "Body posture showing engagement with the instrument.",
        "Reflections or shine on the piano surface visible.",
        "Dim or illuminated room indicating a performance ambiance.",
        "Black and white keyboard prominently visible, with hands positioned over keys.",
        "The body of the piano varies—grand or upright style being common.",
        "Music sheets are often placed on a stand next to the instrument.",
        "Player’s posture is usually seated, with focus on hand movements.",
        "Surrounding may include a concert setting or intimate room ambiance.",
        "Pianist seated in front of a grand piano, hands on the keys.",
        "Open lid of the piano revealing the strings and hammers.",
        "Body posture indicating focused playing, often with sheet music present.",
        "Multiple keys highlighted as they are pressed down.",
        "Surrounding environment may include a concert hall backdrop.",
        "Black and white keys visibly played by the musician’s hands.",
        "Can include a grand piano or upright, showcasing its design.",
        "The player’s facial expression often indicates concentration or emotion.",
        "Sheet music may be present on a stand, indicating performance context.",
        "Stage or indoor concert setting with chairs or audience may be visible."
    ],
    "Playing Sitar": [
        "Long-necked string instrument with multiple strings.",
        "Unique tuning pegs and resonance chamber clearly visible.",
        "Player using finger techniques, including a plectrum.",
        "Distinctive body posture while seated on the ground.",
        "Rich cultural or traditional elements often appear in the background.",
        "Musician seated with a large sitar, often with intricate decorations.",
        "Fingers positioned on the strings and frets, creating sound.",
        "Cultural garments complementing the traditional vibe.",
        "Possible traditional performance setup with audience.",
        "Focus on the sitar's unique shape and multiple strings.",
        "Long necked instrument with distinct frets and sympathetic strings.",
        "Player sitting down, often with intricate hand positions on the strings.",
        "The sitar is often decorated with inlays and a unique round body.",
        "Surroundings may feature rugs, cultural decor, or other musicians.",
        "Execution usually involves a serene facial expression, reflecting the music.",
        "Musician seated on the floor or in a traditional pose, playing the sitar.",
        "Long neck of the sitar extending outward with visible strings.",
        "Cultural attire possibly adorned with traditional patterns.",
        "Expressive hand movements highlighted as the musician plucks strings.",
        "Decorative elements on the sitar body emphasized.",
        "Long, ornate neck and body with intricate carving details.",
        "Wide, resonating strings displayed in action.",
        "Player's fingers shown executing specific techniques on the frets.",
        "Traditional attire of the player indicating cultural significance.",
        "Often seen in a colorful or richly decorated environment."
    ],
    "Playing Tabla": [
        "Circular hand-played drums, with played bass and treble.",
        "Player’s hands depicted in rhythmic motion.",
        "Traditional clothing, often decorative, worn by musician.",
        "Emphasis on intricate hand techniques and finger positioning.",
        "Cultural setting may feature ensemble or audience engagement.",
        "Individual playing two hand-played drums known as tabla.",
        "Hands captured in motion, striking the drum surfaces.",
        "Detailed craftsmanship of the tabla visible.",
        "Cultural attire of the musician, indicating tradition.",
        "Set in a lively performance context or rehearsal space.",
        "Pair of hand-played drums, with distinct circular shapes and tension pegs.",
        "Hands in dynamic positions, showcasing different playing techniques.",
        "Surfaces of the drums often decorated with intricate designs.",
        "Seating position is typically cross-legged on the floor.",
        "The environment may include cultural elements, like art or textiles.",
        "Musician positioned on the ground, using both hands on two tablature drums.",
        "Close-up of hands striking the surface of the drums.",
        "Intricate patterns on the drum skin visible.",
        "Possible presence of an audience appreciating the performance.",
        "Cultural attire, like traditional Indian clothing, could be depicted.",
        "Two distinct drums with contrasting sizes and shapes.",
        "Artist's hand movements visible as they strike the surfaces.",
        "Decorative patterns on the drums, emphasizing tradition.",
        "Player often seated on the ground, indicating relaxed posture.",
        "Background may reflect a rich cultural or musical setting."
    ],
    "Playing Violin": [
        "Bow moving across the strings of a shoulder-held instrument.",
        "Player's posture emphasizing balance and control.",
        "Closed circular position of left hand gripping the neck.",
        "Facial expression reflects concentration and emotion in playing.",
        "Background often includes orchestral setting or concert hall.",
        "Musician with a violin under the chin, bow in hand.",
        "Focused expression while playing, with fingers on the strings.",
        "Vibrant clothing or concert outfit visible.",
        "Sound hole and scroll of the violin prominently displayed.",
        "Indoor performance or orchestral setting indicated.",
        "Small, elegant instrument held firmly under the chin while bowing.",
        "The body of the violin is curvaceous, often reflecting light.",
        "Bow in motion on the strings, with fingers pressing down on the fingerboard.",
        "Typically includes sheet music on a stand in front of the player.",
        "The musician often displays intense concentration, enhancing the visual.",
        "Violinist holding the violin under their chin, bow in motion.",
        "Curved shape of the violin clearly visible.",
        "Expression of concentration on the musician’s face.",
        "Bowing hand depicted in action, with visible strings underneath.",
        "Background may include an orchestral setting or music sheets.",
        "Small wooden instrument with a slightly curved body.",
        "Bow in motion across the strings, often creating a dynamic angle.",
        "Player’s fingers positioned on the fingerboard clearly visible.",
        "Expression of concentration or passion on the musician's face.",
        "Typically set in a concert or rehearsal environment."
    ],
    "Pole Vault": [
        "Pole being used to propel an athlete upward.",
        "Athlete’s form often arched in flight over the bar.",
        "Take-off area and landing mat clearly visible.",
        "Competition uniform, including spikes on shoes, highlighted.",
        "Crowd or stadium setting in the background.",
        "Athlete preparing to vault with a pole in hand.",
        "Dynamic motion with body leaping into the air.",
        "Vaulting bar visible, often at height levels.",
        "Track and field environment evident with spectators.",
        "Focus on the pole's angle and athlete's technique.",
        "Athlete in mid-air with a long pole, showcasing posture and flight.",
        "Landing area often contains a large mat below.",
        "Vaulting pole is prominent, often metallic and flexible in appearance.",
        "Background may show a track or field setting, with spectators.",
        "Athlete's sportswear is typically fitted for aerodynamics.",
        "Athlete positioned with a long pole, preparing to vault.",
        "Motion indicating upward thrust with the pole bent.",
        "Mat or landing area visible below.",
        "Track background may show defined run-up lanes.",
        "Spectators or other athletes may be seen in the background.",
        "Long pole held by the athlete before takeoff.",
        "Athlete's body raised high in the air during the jump.",
        "Landing area with a pit visible beneath the athlete's arc.",
        "Dynamic posture with clear motion indicating upward momentum.",
        "Track and field background with spectators or officials."
    ],
    "Pommel Horse": [
        "Athlete performing rotations or holds on a padded apparatus.",
        "Focus on upper body strength and balance.",
        "Legs often positioned in specific, well-defined angles.",
        "Gymnastics attire with distinct designs or colors.",
        "Background may show judges or gymnastics equipment.",
        "Gymnast in mid-air maneuvering around the pommel horse.",
        "Arms gripping the pommels, body horizontal above the horse.",
        "Wood grain texture of the pommel horse distinctly visible.",
        "Bright gymnasium environment with mats surrounding.",
        "Action captured showing the grace and strength of the gymnast.",
        "Gymnast performing on a padded horse-like apparatus with grips on the sides.",
        "Legs often in dynamic positions – split or bent – while balancing.",
        "The apparatus is low to the ground with a distinct rectangular shape.",
        "Posture shows strength, with arms gripping and body often inverted or horizontal.",
        "Surroundings may include gym flooring and supportive equipment.",
        "Gymnast performing a routine on a pommel horse.",
        "Legs straddled or moving in a circular motion.",
        "Horizontal apparatus with pommels clearly shown.",
        "Focused expression displayed, indicative of concentration.",
        "Gymnast's form emphasizing balance and strength.",
        "A horse-shaped apparatus with handles on each end.",
        "Gymnast's arms and legs displayed in a horizontal position.",
        "Unique circular or scissor movements as the gymnast swings.",
        "Chalk dust may be evident on the gymnast's hands.",
        "Gym environment with possible judges or observers nearby."
    ],
    "Pull Ups": [
        "Individual grasping a horizontal bar, body suspended.",
        "Body’s motion characterized by upward lifting of the chin.",
        "Clear focus on upper body strength and muscle definition.",
        "Workout setting with gym equipment typically nearby.",
        "Physical strain visible on the athlete’s face.",
        "Individual gripping a pull-up bar, body pulled upwards.",
        "Visible tension in arms and muscles clearly defined.",
        "Background may show home gym or fitness center.",
        "Possible chalk dust on hands, indicating effort.",
        "Focus on the straight body line achieved during the exercise.",
        "Athlete hanging from a horizontal bar, arms bent and pulling upwards.",
        "Focus on muscular tension in arms and upper body.",
        "Action shows a determined facial expression, emphasizing effort.",
        "Background typically contains gym equipment, such as weights or bars.",
        "Attire usually includes athletic wear designed for comfort and movement.",
        "Individual gripping a pull-up bar, pulling body upwards.",
        "Arms visibly engaged, showing muscle definition.",
        "Body in a semi-stretched or curled position.",
        "Possible gym or outdoor setting depicted in the background.",
        "Facial expression may show effort or concentration.",
        "Athlete hanging from a horizontal bar with hands gripping.",
        "Body in an upward motion, showcasing strength and effort.",
        "Tension in arms and back muscles visually pronounced.",
        "Setting may vary from a gym to an outdoor pull-up bar.",
        "Potential for multiple athletes sharing the bar in some images."
    ],
    "Punch": [
        "Fist visibly moving towards a target with force.",
        "Athlete's stance often shows balance and tension.",
        "Heavy focus on the arm and shoulder movement.",
        "Action may show motion lines or speed effects.",
        "Combat sports attire, such as gloves, often highlighted.",
        "Individual delivering a punch with a fist extended forward.",
        "Dynamic stance with body weight shifting or moving.",
        "Possible sweat or tension visible in the muscles.",
        "Boxing gloves may be noticeable.",
        "Training or boxing ring environment visible in the background.",
        "Hand depicted in motion, often connected with a target like a punching bag.",
        "Dramatic arm position showing extension and body rotation.",
        "Position and stance of the fighter conveys balance and power.",
        "Background may feature a gym or sparring area with gloves visible.",
        "Facial expression often shows intensity or focus.",
        "Boxer or martial artist in a punch stance, fist extended forward.",
        "Emphasis on movement and body form indicating strength.",
        "Potential presence of gloves or padding.",
        "Action lines may indicate motion or impact.",
        "Possibly a boxing ring or training area in the background.",
        "Athlete's hand in motion, often mid-rotation or extension.",
        "A dynamic stance, potentially showing foot positioning.",
        "Possible motion blur indicating speed and force.",
        "Boxing gloves and possibly protective gear evident.",
        "Background may feature a boxing ring or training facility."
    ],
    "Push Ups": [
        "Body in a plank position with hands and toes on the ground.",
        "Motion depicted as the body lowers and raises in sync.",
        "Emphasis on core strength and alignment.",
        "Environment often includes gym mats or exercise areas.",
        "Facial expressions reflecting exertion are noticeable.",
        "Individual in a plank position, arms extended straight.",
        "Body parallel to the ground, showcasing core engagement.",
        "Possible floor surface, like a mat or gym floor.",
        "Motion blurring may indicate effort or intensity.",
        "Fitness setting possibly featuring other equipment nearby.",
        "Athlete positioned on the floor, hands and feet supporting the body.",
        "Dynamic motion shown from a bent-arm position to an extended position.",
        "Focus on core strength and alignment of the body.",
        "Typically performed on a mat or soft surface in an exercise area.",
        "Attire is commonly athletic, suitable for working out.",
        "Individual positioned in a plank position, lowering and raising their body.",
        "Emphasis on core stability and arm strength.",
        "Horizontal alignment of body highlighted.",
        "Gym mat or floor beneath the individual.",
        "Possible fitness attire to indicate workout context.",
        "Athlete's body in a plank position with arms extended.",
        "Clear display of core strength and discipline during the exercise.",
        "Hands positioned on the ground, indicating active form.",
        "Often shown outdoors in parks or home gym settings.",
        "Variations may include weights or elevated feet."
    ],
    "Rafting": [
        "Inflatable raft navigating through turbulent water.",
        "Paddles visibly splashing and creating waves.",
        "Participants wearing life jackets and helmets for safety.",
        "Rapid movement through vibrant, colorful natural surroundings.",
        "Action shot may show splashes and water droplets flying.",
        "Group of rafters in a colorful inflatable raft navigating water.",
        "Splashing water captured around the raft.",
        "Paddles visible in each person's hand, engaged in the activity.",
        "Scenic river environment with lush banks or cliffs.",
        "Safety gear like helmets and life jackets prominently worn.",
        "Colorful inflatable raft on moving water, often filled with participants.",
        "Dynamic water splashes around the raft, creating an energetic scene.",
        "Paddles in use, with hands actively engaged, emphasizing teamwork.",
        "Surroundings feature natural landscapes like rivers, mountains, or trees.",
        "Participants usually wear life jackets and helmets for safety.",
        "Group of people in a bright-colored raft navigating water.",
        "Paddles depicted in action, splashing water.",
        "Rapids or waves visible in the background.",
        "Safety gear such as life jackets prominently displayed.",
        "Adventure or nature setting accentuates the activity.",
        "Brightly colored inflatable rafts in turbulent water.",
        "Rapid movement shown through splashing water.",
        "Participants wearing life vests and helmets for safety.",
        "Scenic backgrounds of rivers, mountains, or forests present.",
        "Group dynamics, with multiple people paddling together."
    ],
    "Rock Climbing Indoor": [
        "Climber navigating artificial rock wall with various holds.",
        "Harness and ropes clearly depicted for safety.",
        "Vibrant colors of climbing holds against neutral wall color.",
        "Athlete’s body posture and grip emphasize strength and technique.",
        "Background often shows a climbing gym environment.",
        "Individual climbing a vertical wall with colorful holds.",
        "Harness and rope system evident for safety.",
        "Dynamic body movements showcased in the ascent.",
        "Climbing gym environment with gym mats and spectators.",
        "Chalk dust visible, indicating gripping technique.",
        "Climber on a vertical wall with colorful holds and grips.",
        "Safety harness and ropes are visible, indicating secured climbing.",
        "Dynamic body movements displayed, often stretching or reaching.",
        "Background typically a gym setting with a climbing wall.",
        "Climber attire includes climbing shoes and comfortable, flexible clothing.",
        "Individual on a climbing wall, gripping holds with both hands.",
        "Vivid, multicolored holds visible against a gym backdrop.",
        "Climber's body in a dynamic pose, possibly reaching upward.",
        "Safety harness and ropes emphasized in the scene.",
        "Enthusiastic expressions may be captured.",
        "Climber attached to harness and chalk bag on a climbing wall.",
        "Colorful holds of various shapes and sizes visibly used.",
        "Dynamic reaching and body positioning observable.",
        "Indoor environment with safety mats and instructors.",
        "Bright lighting highlighting both climber and wall features."
    ],
    "Rope Climbing": [
        "Individual ascending a vertical rope, legs often raised.",
        "Hands gripping the rope tightly, showcasing effort.",
        "Body’s alignment reflecting core strength and balance.",
        "Gym environment usually includes mats or other fitness equipment.",
        "Action may capture the upward motion and determination.",
        "Person ascending a vertical rope, legs clinging.",
        "Focus on upper body strength, arms and hands engaged.",
        "Background possibly showing a gym or training area.",
        "Visible tension in the rope, indicating difficult ascent.",
        "Fitness attire showcasing movement and flexibility.",
        "Athlete climbing a vertical rope, hands gripping tightly while legs aid.",
        "Visible tension in the rope, emphasizing muscular effort and focus.",
        "Background setting may include a gym or open space with strong lighting.",
        "Feet may be shown bracing against the rope or wall for traction.",
        "Typically includes athletic wear suited for physical activity.",
        "Athlete gripping a thick rope, ascending or positioned midway.",
        "Strained muscles highlighted as the individual climbs.",
        "Rope’s texture and structure prominently shown.",
        "Indoor or gym setting depicted, often with other athletes.",
        "Focus on arm and leg positioning indicating strength.",
        "Athlete gripping a thick rope, often pulling themselves up.",
        "Visible upper body tension and strong arm movements.",
        "Foot positioning on the rope or wall may be illustrated.",
        "Indoor gym setting or outdoor obstacle course may be present.",
        "Possible use of climbing aids or harnessing equipment."
    ],
    "Rowing": [
        "Rowers in a boat, synchronized in pulling oars through water.",
        "Water splashing visibly around the oars.",
        "Athletic gear visible, often with team colors displayed.",
        "Boat’s wake clearly seen behind the rowing action.",
        "Background may show serene river or competitive setting.",
        "Rowers in a boat using long oars, visible water ripples.",
        "Teamwork and synchronization among rowers clearly depicted.",
        "Cityscape or nature setting in the background.",
        "Expressions of concentration and effort visible on rower's faces.",
        "Splashing water around oars captured in dynamic action.",
        "Rowers seated in a boat, oars positioned in sync, creating motion.",
        "Water disturbances behind the boat, highlighting speed and movement.",
        "The boat's structure is sleek and streamlined, designed for water.",
        "Participants often wear sports attire suitable for water activities.",
        "Background may show lakes, rivers, or racing settings with spectators.",
        "Rowers in a boat with oars positioned in the water.",
        "Motion captured as oars push against the water.",
        "Body posture emphasizes teamwork and coordinated movement.",
        "Water surface visible with ripples created by the oars.",
        "Background may show a river or rowing competition setting.",
        "Rowers in boats, each with distinct oars in synchronized motion.",
        "Water splashing as oars enter and exit fluid.",
        "Boats often sleek and narrow, contrasting with wider bodies of water.",
        "Team dynamics if multiple rowers are visible.",
        "Background showcasing a river or lake setting."
    ],
    "Salsa Spin": [
        "Dancer captured mid-spin with flowing movements.",
        "Colorful attire reflecting the rhythm of the dance.",
        "Expressions of joy and energy are evident on the dancer's face.",
        "Motion delineation may show movement trailing behind the spin.",
        "Surroundings often adorned with dancing partners or festive decor.",
        "Dancers in a dynamic pose, one partner spinning around.",
        "Vibrant clothing reflecting the energy of salsa dancing.",
        "Movement captured, indicating rhythm and enthusiasm.",
        "Possible dance studio or performance stage setting.",
        "Facial expressions showing joy and engagement with the music.",
        "Dancers in vibrant clothes, showcasing circular movement.",
        "One partner often visibly leading while the other follows, creating contrast.",
        "Flowing skirts or loose clothing may accentuate the spinning motion.",
        "Enthusiastic expressions and body language emphasizing joy and rhythm.",
        "Background could include a dance floor or studio atmosphere.",
        "Dancer caught in a dynamic spinning motion, arms extended.",
        "Bright, colorful attire emphasizing festive energy.",
        "Partner may be present, showcasing a dance connection.",
        "Dance floor or event space featured in the background.",
        "Facial expressions indicating joy and engagement are visible.",
        "Dancers closely interacting with dramatic arm movements.",
        "Skirts or clothing often swirling, highlighting motion.",
        "Partnering positions emphasized, with engaged facial expressions.",
        "Dance floor or lively setting enhances overall atmosphere.",
        "Vibrant colors and lighting may reflect the energy of the dance."
    ],
    "Shaving Beard": [
        "Razor or trimmer visibly used on facial hair.",
        "Close-up focus on the face showing hair removal progress.",
        "Cream or gel may be applied, creating a shiny surface.",
        "Reflections of grooming products often nearby.",
        "Setting may include a bathroom mirror and tools.",
        "Individual holding a razor or shaving tool near the face.",
        "Close-up of skin and lather indicating shaving activity.",
        "Mirror visible, reflecting the individual's focused expression.",
        "Possible bathroom setting with grooming supplies nearby.",
        "Shaving foam or gel contrasting against facial hair.",
        "Person holding a razor or electric shaver with focus and attention.",
        "Lather or shaving cream visibly applied to the facial hair.",
        "Mirror often present in the background for detailed grooming.",
        "Person's expression can convey concentration or relaxation.",
        "Typically includes bath or grooming accessories around.",
        "Individual holding a razor or trimmer near their face.",
        "Lather or shaving cream visible on the skin.",
        "Focused facial expression indicating concentration.",
        "Mirror or sink may be visible in the background.",
        "Possible grooming accessories such as brushes or lotion shown.",
        "Close-up of a person’s face with shaving cream applied.",
        "Razor in hand, showing meticulous focus on technique.",
        "Possible reflections or water droplets being captured.",
        "Bathroom environment typically suggested through tiles or mirrors.",
        "Grooming tools visible, creating a context of care."
    ],
    "Shotput": [
        "Athlete preparing to throw a heavy metal ball.",
        "Low stance, often with a focused facial expression.",
        "Motion captured during release, showing arm extension.",
        "Circular throwing area visibly marked on the ground.",
        "Background often depicts crowd or athletic field.",
        "Athlete preparing to throw a heavy shot put.",
        "Dynamic posture showing the thrower’s strength and technique.",
        "Shot put ball visible in hand, focusing on grip.",
        "Track and field background with spectators or officials.",
        "Muscles engaged, emphasizing the intensity of the throw.",
        "Athlete positioned to throw a heavy metal ball, muscular stance displayed.",
        "Heavy ball (shotput) prominently visible, often in the hand or in motion.",
        "The circle area is marked where the throw takes place, with distinct lines.",
        "Surroundings may include a field setting with spectators and markings.",
        "Athletes often wear fitted athletic clothing for performance.",
        "Athlete in a throwing stance, holding a heavy shot put.",
        "Dynamic body posture indicating strength and readiness to throw.",
        "Circular shot put distinctly featured in the athlete's hand.",
        "Shot put ring or field area visible in background.",
        "Focus may be on the athlete's face showing determination.",
        "Heavy spherical shot in hand of the athlete preparing to throw.",
        "Distinctive stance indicating physical effort and focus.",
        "Marked throwing area with a concrete circle in the background.",
        "Athlete's muscular build may be highlighted during throw.",
        "Engaged spectators or officials potentially in the background."
    ],
    "Skate Boarding": [
        "Skateboard mid-motion with one foot elevated.",
        "Urban environment with ramps or concrete evident.",
        "Skater's body posture reflecting balance and style.",
        "Colorful skateboard graphics and attire worn by the skater.",
        "Dynamic movement captured may include airborne elements.",
        "Individual performing a trick on a skateboard.",
        "Skateboard clearly visible, often in motion or air.",
        "Urban environment with ramps or rails in the background.",
        "Colorful skateboard designs capturing attention.",
        "Dynamic pose indicating skill and balance.",
        "Skateboard visibly in motion, with the rider performing tricks.",
        "Dynamic body posture, showcasing movement and balance.",
        "Urban surroundings, such as skate parks or streets with ramps.",
        "Protective gear like helmets and pads may be visible.",
        "Vibrant skateboard graphics add visual interest.",
        "Individual performing tricks or riding a skateboard.",
        "Motion emphasized with the skateboard raised off the ground.",
        "Urban or skate park environment in the background.",
        "Loose, casual clothing typical for skate culture depicted.",
        "Vibrant colors and possible graffiti art in the setting.",
        "Skateboard with distinct graphics and wheels captured mid-trick.",
        "Athlete performing stunts or tricks with elevated posture.",
        "Urban setting indicated through sidewalks or ramps.",
        "Emphasis on balance and motion in the skateboard's angle.",
        "Casual clothing and accessories, indicative of skate culture."
    ],
    "Skiing": [
        "Skier in motion down a snow-covered slope.",
        "Ski poles held up, emphasizing speed and technique.",
        "Colorful winter gear stands out against white snow.",
        "Curved trajectory in the snow indicating movement direction.",
        "Background shows ski lift or mountain scenery.",
        "Skier in motion down a snowy slope.",
        "Skis visibly angled, showing carving technique.",
        "Snow and mountain backdrop creating a dynamic winter scene.",
        "Ski poles in hand, indicating balance and control.",
        "Bright ski gear contrasting against white snow.",
        "Skier in motion on snow-covered slopes, often with poles.",
        "Snow flying up behind the skier, illustrating speed and momentum.",
        "Skis are long and narrow, prominent in the foreground.",
        "Winter clothing, often colorful and layered, is standard.",
        "Surroundings are icy and mountainous, creating a winter landscape.",
        "Skier in a crouched position, racing down a slope.",
        "Skis prominently extended horizontally, cutting through snow.",
        "Snow-covered landscape with trees or mountains in background.",
        "Ski poles held tightly in hands may be seen.",
        "Winter attire such as jackets and goggles highlighted.",
        "Skier in motion down a snowy slope, typically with poles.",
        "Ski gear, including goggles and bright-colored suits, prominently displayed.",
        "Snow spray in the air as skis carve through the surface.",
        "Mountains or trees captured in the background, indicating elevation.",
        "Dynamic body positioning, showing agility and controlled descent."
    ],
    "Skijet": [
        "Jet ski gliding over water with significant spray.",
        "Rider holding onto handlebars, often in a dynamic stance.",
        "Bright colors of the jet ski stand out against the water.",
        "Motion captured showing speed and agility on the surface.",
        "Background may include a sunny beach or water sport setting.",
        "Individual riding a jet ski on open water.",
        "Water splashes and spray visible behind the jet ski.",
        "Dynamic body position, leaning into the ride.",
        "Scenic lake or ocean backdrop capturing the thrill.",
        "Safety gear like life jackets worn, indicating water sports.",
        "A person on a jet ski, typically in a dynamic water setting.",
        "Water splashes and waves around the jet ski, creating movement.",
        "Rider often positioned low, with a powerful stance, hands gripping handles.",
        "Bright safety gear such as life jackets prominently visible.",
        "Background may feature lakes, rivers, or tropical beaches.",
        "Individual riding a skijet on water, positioned upright.",
        "Splashes of water evident beneath the skijet.",
        "Bright safety gear often worn for visibility.",
        "Motion captured indicating speed and thrill of the ride.",
        "Water or beach setting visible in the background.",
        "Person sitting on a jet ski, aquatic environment visible.",
        "High-speed action depicted with water splashes around.",
        "Visibly wearing a life jacket and helmet for safety.",
        "Background often showcases lakes or ocean settings.",
        "Bright colors and sporty design of the jet ski highlighted."
    ],
    "Sky Diving": [
        "Parachutist in free fall, arms and legs spread wide.",
        "Cloudy sky and earth below are clearly visible.",
        "Expressions of thrill and excitement are shown on the diver.",
        "Parachute may be deployed, revealing colorful fabric.",
        "Background may include fellow divers or a plane above.",
        "Diver in freefall, arms spread wide against the backdrop of sky.",
        "Parachute clearly visible in the deployment phase or packed away.",
        "Cloud formations or ground visible far below.",
        "Expressions of exhilaration and adrenaline captured.",
        "Bright skydiving suit contrasting with the blue sky.",
        "Diver in free fall with arms and legs spread wide, showcasing gravity.",
        "Colorful parachute often visible during descent preparation.",
        "Expression of exhilaration and excitement on the diver's face.",
        "Sky and clouds create a dramatic backdrop, emphasizing height and speed.",
        "Typically includes wearing specialized jumpsuits and harnesses.",
        "Diver free-falling with arms and legs spread out.",
        "Parachute may be seen deployed or about to be.",
        "Stunning aerial background with clouds or scenery below.",
        "Gear such as helmets and jumpsuits highlighted.",
        "Expressions of excitement or thrill shown on the diver's face.",
        "Diver free-falling with parachute deployed or in dynamic pose.",
        "Blue sky and clouds as backdrop indicating altitude.",
        "Bright jumpsuits and gear that stand out against the sky.",
        "Group dynamics if multiple divers are present.",
        "Possible landscape view below, enhancing sense of height."
    ],
    "Soccer Juggling": [
        "Soccer ball in mid-air, feet positioned to control it.",
        "Player's focus and coordination evident through body posture.",
        "Brightly colored soccer jersey contrasts with the field.",
        "Ball's motion indicated through movement lines or blurs.",
        "Grass or turf field clearly visible in the surroundings.",
        "Individual juggling a soccer ball with feet and knees.",
        "Dynamic motion, showing control and skill over the ball.",
        "Outdoor setting on a grassy field evident.",
        "Ball positioned high, indicating juggling technique.",
        "Casual clothing suggestive of recreational soccer play.",
        "Player juggling a soccer ball with feet, knees or head, showcasing skill.",
        "Action shows the ball mid-air, emphasizing balance and technique.",
        "Player's posture is dynamic and focused, often surrounded by open space.",
        "Background may include a soccer field or practice area.",
        "Attire typically consists of soccer jerseys, cleats, and shorts.",
        "Player juggling a soccer ball expertly with feet, knees, or head.",
        "Dynamic body position, possibly mid-juggle or in movement.",
        "Grass pitch or soccer field in the background.",
        "Soccer ball prominently featured, possibly showing motion.",
        "Focused facial expression displaying skill and concentration.",
        "Player balancing a soccer ball on different body parts.",
        "Dynamic poses often captured during juggling motion.",
        "Grass field or urban environment may form the backdrop.",
        "Expression of concentration and skill evident in player’s face.",
        "Colorful uniforms representing teams may be visible."
    ],
    "Soccer Penalty": [
        "Player preparing to kick the ball towards the goal.",
        "Goalkeeper in a ready position, focused on the shooter.",
        "Clear outlines of the penalty box and goal posts.",
        "Tension in player’s body depicted as they take the shot.",
        "Spectators or teammates may be seen in the background.",
        "Player in a kicking stance preparing for a penalty shot.",
        "Goalpost and net clearly visible in the background.",
        "Focus on the soccer ball at the penalty mark.",
        "Expression of determination and concentration captured.",
        "Pitch markings visible, indicating the soccer field layout.",
        "Player preparing to take a shot at the goal, often in a focused stance.",
        "Goalkeeper positioned in front of the goal, ready to defend.",
        "Soccer ball prominently visible at the player’s feet or in motion.",
        "Field markings, such as the penalty area, clearly present.",
        "The environment may include cheering crowds or teammates, adding energy.",
        "Player lined up to kick a soccer ball toward the goal.",
        "Goalkeeper positioned in front of the goal, ready for action.",
        "Visible penalty area markings on the field.",
        "Tension captured in body language as the kick is imminent.",
        "Crowd or teammates potentially in the background watching closely.",
        "Player poised to kick the ball, with the goal and goalkeeper visible.",
        "Tension captured in the moment before the kick.",
        "Field markings like the penalty area clearly shown.",
        "Celebratory or anxious facial expressions of teammates may be present.",
        "Goalposts and netting provide context of the activity."
    ],
    "Still Rings": [
        "Gymnast holding onto two rings, legs extended downward.",
        "Focus on upper body strength and stability during holds.",
        "Athlete's intense concentration visible on their face.",
        "Surrounding area of the gym with apparatus often highlighted.",
        "Form and technique evident in the body’s position.",
        "Gymnast suspended on rings, body in a distinctive pose.",
        "Rings dangling from a high bar, indicating strength.",
        "Close focus on hand grip and muscular tension.",
        "Gymnasium environment, possibly with mats below.",
        "Dynamic motion, capturing the artistry of the routine.",
        "Athlete performing strength poses while suspended on two rings.",
        "Body parallel to the ground, emphasizing control and muscle tension.",
        "Rings are typically metallic and hang from a high structure.",
        "The gym background often includes equipment like mats and bars.",
        "Posture highlights discipline and training, often serious in nature.",
        "Gymnast suspended in the air holding onto rings.",
        "Core muscles visibly engaged, body in a strong position.",
        "Rings clearly depicted, hanging from overhead support.",
        "Gymnast's attire emphasizing athletic performance.",
        "Mat below for safety potentially included in the scene.",
        "Athlete hanging from two rings, displaying upper body strength.",
        "Rings often set high above the ground for balance exercises.",
        "Tension in arms and core, indicating controlled movement.",
        "Gym environment with mats or padding beneath visible.",
        "Possible audience or judges visible in a competitive setting."
    ],
    "Sumo Wrestling": [
        "Wrestlers wearing mawashi (belt) in a circle ring.",
        "Intense facial expressions reflecting focus and competition.",
        "Stances showing low center of gravity, both competitors looking at each other.",
        "Surroundings include a sandy ring (dohyo) and audience.",
        "Traditional attire highlights the cultural significance of the sport.",
        "Two sumo wrestlers in traditional mawashi, engaging in a bout.",
        "Defined body postures indicating strength and stance.",
        "Clay or sandy surface of the sumo ring visible.",
        "Spectators and ceremonial elements in the background.",
        "Intense facial expressions showing focus and determination.",
        "Two wrestlers (rikishi) in traditional attire (mawashi) positioned to grapple.",
        "The ring (dohyō) is circular and often surrounded by spectators.",
        "Rigid and powerful body language, emphasizing strength and balance.",
        "Attractively decorated salt may be present as part of the tradition.",
        "Unique headgear (if worn), and distinctive rituals before matches.",
        "Two sumo wrestlers in a traditional stance, facing each other.",
        "Attire includes mawashi, traditional sumo belts.",
        "Emphasis on strength and size of the wrestlers visually.",
        "Clay or raised ring visible where the match takes place.",
        "Intense expressions and dynamic movements captured.",
        "Large body figures in traditional mawashi attire, engaged in combat.",
        "Distinct stance with wide foot positioning highlighted.",
        "Clay or sand ring (dohyo) often featured in the background.",
        "Cultural symbols or crowds representing the event may be visible.",
        "Intense expressions depicting determination and strength."
    ],
    "Surfing": [
        "Surfer riding a wave, with the board elevated above water.",
        "Ocean waves splashing around with clear blue water.",
        "Colorful surfboards and wet suits enhancing the visual appeal.",
        "Motion captured as the surfer maneuvers on the wave.",
        "Background may include a beach or other surfers in the distance.",
        "Surfer riding a wave on a surfboard.",
        "Ocean backdrop with visible waves and spray.",
        "Dynamic pose of the surfer, indicating balance.",
        "Bright surfboard designs contrasting with water.",
        "Sunlit beach or coastline visible in the background.",
        "Surfer on a board riding a wave, showcasing motion and balance.",
        "Water splashes and foam around the board, indicating speed.",
        "Brightly colored surfboards often feature unique designs.",
        "Surfer’s attire typically includes swimwear, wetsuits, or rash guards.",
        "Ocean and beach landscape in the background, creating a dynamic environment.",
        "Surfer riding a wave on a surfboard, body angled.",
        "Water splashes prominently illustrated around the surfboard.",
        "Vibrant ocean scene with a visible wave.",
        "Bright colored swimwear highlighting the activity.",
        "Background may include other surfers or beachgoers.",
        "Surfer riding a wave, balancing on a surfboard.",
        "Ocean backdrop with dynamic movement of water.",
        "Vibrantly colored boards and swimwear characteristic of surf culture.",
        "Action captured mid-wave with water splashes.",
        "Possible beach or shoreline background depicting an outdoor scene."
    ],
    "Swing": [
        "Individual suspended in mid-air, seated on a swing.",
        "Ropes clearly visible, connecting to the swing’s frame.",
        "Bright sky or playground setting enhances the visual.",
        "Legs extended or bent, showing motion or stillness.",
        "Vivid colors of clothing contrasting with the outdoor environment.",
        "Individual on a swing set, mid-motion swinging back or forth.",
        "Playgrounds or parks in the background, evoking leisure.",
        "Twisting body posture emphasized by swinging motion.",
        "Bright colors of the swing or clothing visible.",
        "Expressions of joy or excitement from the individual.",
        "Child or adult on a swing, often in mid-air, creating a sense of motion.",
        "The swing's chains or ropes visibly holding it in place.",
        "Surroundings typically include playground equipment or scenic parks.",
        "Dynamic expressions of joy or exhilaration evident in the person's face.",
        "The ground below may show grass or rubber surface for safety.",
        "Individual perched on a swing, legs extended forward or back.",
        "Motion lines or blurs indicate swinging action.",
        "Playground or park setting often depicted in the background.",
        "Joyful facial expression capturing the enjoyment.",
        "Ropes and seat of the swing clearly visible.",
        "Individual or child depicted in mid-air on a swing.",
        "Ropes visibly suspending the swing from a frame or tree.",
        "Background often includes a playground or natural setting.",
        "Joyful expressions or playful movements showcased.",
        "Potential for vivid colors in clothing or swing design."
    ],
    "Table Tennis Shot": [
        "Player poised to strike a small lightweight ball with a paddle.",
        "Quick movements illustrated through stances and paddle position.",
        "Brightly lit indoor table tennis environment.",
        "Ball traveling across the table in a dynamic motion.",
        "Paddles exhibit distinct colors and materials.",
        "Player in a dynamic position preparing to hit the ball.",
        "Table and net clearly delineating table tennis environment.",
        "Brightly colored paddles in action against the ball.",
        "Focus and precision evident in the player's posture.",
        "Indoor sports hall or recreational center in the backdrop.",
        "Player in a ready stance, racquet positioned to hit the ball.",
        "Small, lightweight ball in mid-air, showcasing action.",
        "Table's edges and net prominently included in the frame.",
        "Focused expressions displaying intensity and competitiveness.",
        "The environment may consist of high-energy table tennis settings.",
        "Player positioned with a paddle, about to hit a ping pong ball.",
        "Quick, dynamic movements indicated with body posture.",
        "Table tennis table and net prominently featured in the background.",
        "Focused expression indicating concentration on the game.",
        "Possible presence of an opponent on the other side of the table.",
        "Player's paddle in action striking a ping-pong ball.",
        "Small table with precise boundaries clearly visible.",
        "Intense focus and quick reflexes captured in player’s expressions.",
        "Brightly colored ping-pong balls contrasting against the table.",
        "Indoor setting with light reflections and audience potential."
    ],
    "Tai Chi": [
        "Individual performing slow, deliberate movements.",
        "Soft focus on posture and flowing arm motions.",
        "Traditional attire often highlighted for visual appeal.",
        "Serene outdoor or indoor environment enhancing tranquility.",
        "Emphasis on balance and control within the body’s movements.",
        "Individual performing slow, controlled movements in a stance.",
        "Focus on body alignment and serenity of expression.",
        "Outdoor or tranquil setting, like a park or garden.",
        "Flowing garments indicating motion and grace.",
        "Atmosphere of calmness or meditation surrounding the practitioner.",
        "Individual in a slow, deliberate stance showcasing balance and grace.",
        "Soft, flowing movements that are often very fluid in appearance.",
        "Often performed outdoors in serene settings or parks.",
        "Participants may wear loose, comfortable clothing, emphasizing flexibility.",
        "Facial expressions often reflect calmness and concentration, enhancing the scene.",
        "Individual in a flowing, graceful pose indicative of Tai Chi.",
        "Focused, serene expression on the practitioner’s face.",
        "Natural environment, such as a park or garden, often depicted.",
        "Slow motion captured, highlighting deliberate movements.",
        "Loose, comfortable clothing associated with martial arts.",
        "Athlete in flowing, graceful movements often shown in a serene stance.",
        "Distinctive Tai Chi clothing, typically loose and traditional.",
        "Slow-motion poses emphasizing balance and control.",
        "Natural background, such as parks or gardens often depicted.",
        "Possible inclusion of groups practicing together, emphasizing harmony."
    ],
    "Tennis Swing": [
        "Player in mid-swing, racket raised high impacting the ball.",
        "Ball in motion towards the opponent's side of the court.",
        "Player's positioning and movement demonstrating athleticism.",
        "Brightly colored tennis attire adding vibrancy to the scene.",
        "Court markings and net clearly visible.",
        "Player in the act of swinging a tennis racket at a ball.",
        "Court markings evident, including net and baseline.",
        "Dynamic body posture indicating power and precision.",
        "Bright tennis attire contrasting against the green court.",
        "Audience or surrounding environment noticeable.",
        "Player with a racket raised, preparing to hit a tennis ball.",
        "Court markings, including the netting and lines visible in the background.",
        "Body posture showcases athleticism, often with a forward lean.",
        "Brightly colored tennis attire is typical, representing teams or sponsors.",
        "Ball in motion, demonstrating the speed and tension of the game.",
        "Player in motion, preparing to strike a tennis ball with a racket.",
        "Dynamic body posture shown as they move forward.",
        "Tennis court markings and net visibly depicted in background.",
        "Focus on the racket and ball in mid-swing.",
        "Vibrant athletic wear illustrating the sport setting.",
        "Player's body in a wind-up position before hitting a tennis ball.",
        "Racket prominently showcased in action with a focused grip.",
        "Bright tennis court with white lines clearly outlined.",
        "Dynamic posture, showcasing athleticism and balance.",
        "Audience or other players in the background of the scene."
    ],
    "Throw Discus": [
        "Athlete in a wind-up position preparing to throw.",
        "Discus visibly gripped in one hand, showcasing technique.",
        "Focus on release posture, body angled towards the throw.",
        "Circular throwing area marked clearly on the ground.",
        "Spectators or officials depicted in the background.",
        "Athlete in a wind-up position preparing to throw a discus.",
        "Discus clearly visible in hand, emphasizing grip technique.",
        "Defined musculature highlighted, indicating power and strength.",
        "Track and field setting with spectators present.",
        "Wind or motion captured, indicating the throw's trajectory.",
        "Athlete in a rotational position preparing to release the discus.",
        "The discus prominently held in hand, showcasing grip technique.",
        "Circular throwing area visible, with markings for the throw.",
        "Surroundings may include spectators or field event setups.",
        "Athletes' clothing is typically fitted for aerodynamics.",
        "Athlete in a winding position preparing to release a discus.",
        "Emphasis on the discus shape and grip in the athlete’s hand.",
        "Circle or throwing area visible in the background.",
        "Dynamic body movement captured, showcasing strength.",
        "Focused expression indicating concentration on the throw.",
        "Athlete in a reflective throwing stance, holding a discus.",
        "Circular throwing area marked clearly within the field.",
        "Intense focus and effort captured on the athlete's face.",
        "Potential spectators or judges in the frame indicating competition.",
        "Athletic wear and gear prominently displayed."
    ],
    "Trampoline Jumping": [
        "Athlete captured mid-air with limbs extended or tucked.",
        "Vibrant trampoline surface color contrasts with the jumper.",
        "Motion lines indicating height and rotation.",
        "Athlete's facial expression shows thrill and exhilaration.",
        "Background may include other trampolines or safety equipment.",
        "Individual airborne on a trampoline showcasing acrobatic maneuvers.",
        "Trampoline surface evident with dynamic motion captured.",
        "Expressions of joy or exhilaration visible.",
        "Outdoor or indoor setting with safety mats visible.",
        "Brightly colored trampoline contrasting with the jumper's attire.",
        "Athlete in mid-air, showcasing height and twisting motions.",
        "Trampoline surface visibly distorting as the person pushes off.",
        "Dynamic and energetic expressions reflecting fun or focus.",
        "Bright, colorful trampolines often present in a gym or park setting.",
        "Surroundings might include safety mats or other gymnastic equipment.",
        "Individual mid-air, indicating a high jump or flip.",
        "Trampoline surface visible, showing spring action.",
        "Body posture often dynamic, highlighting movement.",
        "Bright colors of clothing contrasted against the trampoline mat.",
        "Possible background with an indoor or outdoor trampoline area.",
        "Individual airborne above a trampoline, showcasing flips or turns.",
        "Vibrant colors in the trampoline mat and springs.",
        "Dynamic posture capturing the thrill of the jump.",
        "Possible impact or bounce marks on the trampoline surface.",
        "Background may include a gym or outdoor setting with spectators."
    ],
    "Typing": [
        "Hands positioned over a keyboard, fingers in motion.",
        "Screen displaying text or computer interface prominently visible.",
        "Focused facial expression indicating concentration.",
        "Desk setting often featuring office supplies and technology.",
        "Different keyboard styles or layouts may be depicted.",
        "Hands on a keyboard, dynamically pressing keys.",
        "Screen visible, indicating focus on digital composition.",
        "Setting possibly at a desk with other work items around.",
        "Motion of fingers captured, showing typing speed.",
        "Possible computer or office environment suggested.",
        "Hands poised over a keyboard, often shown in a focused position.",
        "Screen or monitor in view, displaying text or data being entered.",
        "Background may include a desk with stationery or a workspace setup.",
        "Proper seated posture typically shown, indicating ergonomic support.",
        "Expressions may convey concentration or multitasking.",
        "Individual seated at a desk, hands positioned over a keyboard.",
        "Close-up of fingers striking keys in motion.",
        "Computer screen potentially illuminating the face.",
        "Office or study setting visible in the background.",
        "Focused expression indicative of concentration on typing.",
        "Hands positioned on a keyboard with fingers engaged in typing.",
        "Close-up of a screen displaying text or code being entered.",
        "Ergonomic keyboard or laptop setting visible.",
        "Minimalist desk or office environment depicted.",
        "Intense focus on the hands or facial expressions indicative of concentration."
    ],
    "Uneven Bars": [
        "Gymnast transitioning between two uneven horizontal bars.",
        "Focus on body position and grip during swings or holds.",
        "Bright gymnastic attire accentuated by movement.",
        "Background showcasing the gym environment and audience.",
        "Action captures the elegant form and muscle control of the athlete.",
        "Gymnast performing on uneven bars, showcasing strength.",
        "Body in mid-air or dynamic grip on the bars.",
        "Parallels spaced apart, clearly defining the apparatus.",
        "Gymnasium background with mats visibly around for safety.",
        "Focused expression of concentration and balance.",
        "Gymnast in mid-air or transitioning between two parallel bars.",
        "A dynamic display of strength, balance, and flexibility often emphasized.",
        "The bars are distinctly at different heights, showcasing the challenge.",
        "The surroundings include mats for safety and colorful gym decor.",
        "The gymnast's attire is fitted, emphasizing movement and style.",
        "Gymnast gripping bars, performing acrobatic skills.",
        "Body often positioned in the air, showcasing strength and tension.",
        "Bars positioned parallel and at different heights.",
        "Gym setting with mats or audience visible in the background.",
        "Focused, intense expression captured during routine.",
        "Gymnast gripping onto two parallel bars, showcasing strength.",
        "Dynamic movements, possibly swinging or transitioning between bars.",
        "Chalk dust on hands indicating that the gymnast uses grip aids.",
        "Gym background, with mats below for safety.",
        "Possible judges or audience observing in a competitive setting."
    ],
    "Volleyball Spiking": [
        "Player jumping with arms raised high to hit the ball.",
        "Ball visibly arcing towards the opposing side of the net.",
        "Team colors and uniforms emphasized in the jump.",
        "Court markings and net highlighting the gameplay.",
        "Facial expressions of intensity reflected in the player's demeanor.",
        "Player in mid-air preparing to spike a volleyball.",
        "Ball visibly positioned above the net in action.",
        "Court markings evident, such as the service line.",
        "Surrounding players visible, indicating teamwork.",
        "Dynamic pose capturing the height and force of the spike.",
        "Player in mid-air, arm raised with a volleyball poised to strike.",
        "Court markings visible, with a net in the background.",
        "Team members positioned strategically, displaying teamwork and dynamics.",
        "Players often in vibrant athletic uniforms, reflecting team colors.",
        "Expression shows determination and focus, enhancing the competitive atmosphere.",
        "Player in the air with an arm raised, preparing to spike a volleyball.",
        "Dynamic motion emphasized, often caught in mid-jump.",
        "Volleyball and net prominently visible.",
        "Team members or spectators depicted in the background.",
        "Exciting expressions displayed during the action.",
        "Player elevated mid-air, preparing to spike the ball.",
        "Volleyball's trajectory depicted with motion blur.",
        "Net and court markings clearly visible in the background.",
        "Colorful team uniforms often highlighted.",
        "Intense concentration on player’s face, demonstrating athleticism."
    ],
    "Walking With Dog": [
        "Individual holding a leash attached to a dog.",
        "Dog’s physical features like fur color and size prominently visible.",
        "Environmental context, like park or street, often visible.",
        "Relationship dynamics expressed through the person’s body language.",
        "Movement of both the person and dog indicates a leisurely pace.",
        "Dog's posture showing eagerness or playfulness.",
        "Outdoor park or neighborhood setting evident.",
        "Casual attire of the person, suggesting leisure activity.",
        "Interaction between person and dog captured, indicating companionship.",
        "Person holding a leash connected to a dog, typically mid-stride.",
        "Dog's posture often playful and engaged, showcasing character.",
        "Environment may include a park setting with grass, trees, or pathways.",
        "Clothing is usually casual and practical for outdoor activity.",
        "Shared expressions between the person and dog highlighting affection and companionship.",
        "Individual holding a leash, walking alongside a dog.",
        "Both figures captured in motion, indicating a leisurely pace.",
        "Nature or park background, possibly with trees or paths.",
        "Focused expressions showing connection and companionship.",
        "Dog’s unique features and breed highlighted during the walk.",
        "Person holding a leash attached to a dog, walking side by side.",
        "Dog’s expression often showing excitement or curiosity.",
        "Outdoor environment with grass, paths, or benches typically observed.",
        "Body language of both human and dog visibly relaxed.",
        "Potential inclusion of other pets or people in the vicinity.",
        "A person holding a leash attached to a dog, showcasing companionship."
    ],
    "Wall Pushups": [
        "Individual performing push-ups against a vertical surface.",
        "Body alignment visible emphasizing core strength.",
        "Focus on muscle engagement in the arms and shoulders.",
        "Domestic or gym environment often depicted in the background.",
        "Clear expression of effort and concentration on the person’s face.",
        "Individual performing push-ups against a wall.",
        "Body posture highlighting form and technique.",
        "Wall surface under hands, indicating exercise method.",
        "Possible fitness environment, like a gym or home.",
        "Expression of effort shown on the individual's face.",
        "Athlete in a standing position, hands against a wall, showcasing strength.",
        "Feet positioned away from the wall, creating a diagonal body line.",
        "The surrounding area includes walls, often in a gym or home setting.",
        "Dynamic movements emphasizing muscular effort, with a clear focus on technique.",
        "Typical athletic wear is visible, suited for exercise.",
        "Individual positioned against a wall, performing pushups.",
        "Body angled, showing engagement of arms and core.",
        "Wall texture and environment indicated, possibly in a home or gym.",
        "Casual clothing emphasized to show a workout setting.",
        "Concentrated expression displayed while performing the exercise.",
        "Athlete pushing against a wall, demonstrating form and effort.",
        "Body positioned at an angle, emphasizing balance and strength.",
        "Close-up or distant view of a wall environment, potentially indoors.",
        "Clear focus on the arms and core engagement.",
        "Casual setting, possibly in a home or gym context for practice."
    ],
    "Writing On Board": [
        "Hand visible holding a marker or chalk writing on the surface.",
        "Whiteboard or blackboard with notes/drawings prominently displayed.",
        "Focused expression on the person actively engaged in writing.",
        "Classroom or workshop environment often setting the scene.",
        "Color contrast between the writing implement and board surface.",
        "Individual using a marker or chalk on a whiteboard or blackboard.",
        "Body posture leaning forward, focused on writing.",
        "Content being written visible, capturing engagement.",
        "Classroom or meeting room background evident.",
        "Writing implement clearly held, indicating the action.",
        "Person facing a whiteboard or chalkboard, with writing utensil in hand.",
        "Body posture often shows concentration or direction as they write.",
        "Text or drawings on the board are relevant to the topic being discussed.",
        "Surrounding may include students or classroom elements creating an educational atmosphere.",
        "Attire may lean towards professional, such as business casual or teaching clothing.",
        "Individual standing or sitting in front of a whiteboard or chalkboard, writing.",
        "Writing instrument (marker or chalk) prominently displayed.",
        "Visuals on the board, such as diagrams or notes, may be included.",
        "Classroom or meeting room setting often shown in background.",
        "Focused expression indicating engagement with the content being written.",
        "Person’s hand holding chalk or marker, actively writing on a board.",
        "Clear writing surface, potentially with colorful diagrams or words.",
        "Body posture indicating engagement or teaching style.",
        "Classroom or presentation environment, often with students visible.",
        "Visual aids or notes may be included in the background."
    ]
}